{
  "fr:Home": "Accueil",
  "fr:Products": "Produits",
  "fr:About": "À propos",
  "fr:Contact": "Contact",
  "de:Home": "Startseite",
  "de:Products": "Produkte",
  "de:About": "Über uns",
  "de:Contact": "Kontakt",
  "es:Home": "Inicio",
  "es:Products": "Productos",
  "es:About": "Acerca de",
  "es:Contact": "Contacto",
  "es:Durable. Reliable.": "Duradero. Confiable.",
  "es:Rosehill TPV - Sports & Recreation Surfaces": "Rosehill TPV - Superficies Deportivas y Recreativas",
  "es:Rosehill TPV": "Rosehill TPV",
  "es:Flexilon® Binders": "Aglutinantes Flexilon®",
  "es:Rosehill TPV Granules": "Gránulos Rosehill TPV",
  "es:Premium Rosehill TPV® rubber granules and Flexilon® binders for sports and recreation surfaces. Durable, reliable, UV stable solutions for playgrounds, MUGAs, tracks and more.": "Gránulos de caucho TPV® Rosehill de primera calidad y aglutinantes Flexilon® para superficies deportivas y recreativas. Soluciones duraderas, confiables y estables a los rayos UV para patios de juegos, áreas deportivas multiuso, pistas y más.",
  "es:UV Stable.": "Estable a los rayos UV.",
  "es:Our Products": "Nuestros Productos",
  "es:Applications": "Aplicaciones",
  "es:Latest Installations": "Últimas Instalaciones",
  "es:About Rosehill Sports & Play": "Acerca de Rosehill Sports & Play",
  "es:Ready to create exceptional surfaces?": "¿Listo para crear superficies excepcionales?",
  "es:Flexilon": "Flexilon",
  "es:Binders": "Aglutinantes",
  "es:Playground Surfaces": "Superficies de Parques Infantiles",
  "es:Multi-Use Games Areas": "Áreas de Juegos Multiuso",
  "es:Running Tracks": "Pistas de Atletismo",
  "es:Sports Pitches": "Campos Deportivos",
  "es:Footpaths": "Senderos Peatonales",
  "es:Splash Parks": "Parques de Agua",
  "es:UK Manufacturing": "Fabricación en Reino Unido",
  "es:Global Recognition": "Reconocimiento Global",
  "es:Innovation & R&D": "Innovación e I+D",
  "es:Quality Assured": "Calidad Asegurada",
  "es:Contact Us": "Contáctanos",
  "es:Company": "Empresa",
  "es:Cookie Settings": "Configuración de Cookies",
  "es:Essential Cookies": "Cookies Esenciales",
  "es:Analytics Cookies": "Cookies de Análisis",
  "es:Rosehill TPV® combines durability, reliability, and UV stability to create high-quality, long-lasting surfaces.": "Rosehill TPV® combina durabilidad, confiabilidad y estabilidad UV para crear superficies de alta calidad y larga duración.",
  "es:Cutting-edge solutions manufactured in the UK using premium virgin polymers": "Soluciones de vanguardia fabricadas en Reino Unido utilizando polímeros vírgenes de primera calidad",
  "es:Cutting-edge, elastomer-based coloured rubber granules manufactured in the United Kingdom. Our unique, 100% fully cross-linked and non-porous granules are polypropylene-free and non-spherical.": "Gránulos de caucho coloreados de vanguardia basados en elastómeros, fabricados en Reino Unido. Nuestros gránulos únicos, 100% completamente reticulados y no porosos, están libres de polipropileno y no son esféricos.",
  "es:Comprehensive range of cleaners, primers, binders, catalysts and pigments for both hot and cold moulding applications. With over 30 years of experience developing MDI polyurethane binders, our Flexilon® range offers solutions for every climate and condition.": "Gama completa de limpiadores, imprimaciones, aglutinantes, catalizadores y pigmentos para aplicaciones de moldeo en caliente y en frío. Con más de 30 años de experiencia desarrollando aglutinantes de poliuretano MDI, nuestra gama Flexilon® ofrece soluciones para cada clima y condición.",
  "es:Versatile solutions for sports, recreation, and safety surfacing across diverse environments": "Soluciones versátiles para superficies deportivas, recreativas y de seguridad en diversos entornos",
  "es:Safe, non-slip surfaces for children's play areas with excellent impact absorption and vibrant colour options.": "Superficies seguras y antideslizantes para áreas de juegos infantiles con excelente absorción de impactos y opciones de colores vibrantes.",
  "es:Durable court surfaces suitable for basketball, tennis, netball and other sports with superior UV resistance.": "Superficies de cancha duraderas adecuadas para baloncesto, tenis, netball y otros deportes con resistencia superior a los rayos UV.",
  "es:High-performance athletic track surfaces providing optimal grip, comfort, and longevity for competitive sports.": "Superficies de pista atlética de alto rendimiento que proporcionan agarre, comodidad y longevidad óptimos para deportes competitivos.",
  "es:Synthetic turf and pitch surfaces with excellent drainage and consistent playing characteristics year-round.": "Superficies de césped sintético y campos con excelente drenaje y características de juego consistentes durante todo el año.",
  "es:Slip-resistant pathway surfaces ideal for parks, trails, and public spaces with low maintenance requirements.": "Superficies de senderos antideslizantes ideales para parques, senderos y espacios públicos con bajos requisitos de mantenimiento.",
  "es:Water-resistant surfaces perfect for water play areas, providing safety and comfort in wet conditions.": "Superficies resistentes al agua perfectas para áreas de juegos acuáticos, proporcionando seguridad y comodidad en condiciones húmedas.",
  "es:Discover our recent projects showcasing TPV surfaces worldwide": "Descubre nuestros proyectos recientes que muestran superficies TPV en todo el mundo",
  "es:Loading latest installations...": "Cargando las últimas instalaciones...",
  "es:Market-leading manufacturer with global recognition and trust": "Fabricante líder en el mercado con reconocimiento y confianza global",
  "es:State-of-the-art facilities in Yorkshire using unique polyurethane chemistry, tailor-made for the toughest environments.": "Instalaciones de vanguardia en Yorkshire que utilizan química de poliuretano única, diseñada específicamente para los entornos más exigentes.",
  "es:Specified by architects and designers worldwide, from Olympic Games venues to Disney, Sea World, and Universal Studios.": "Especificado por arquitectos y diseñadores de todo el mundo, desde sedes de Juegos Olímpicos hasta Disney, Sea World y Universal Studios.",
  "es:Continuous innovation driven by talented polymer scientists and extensive research capabilities.": "Innovación continua impulsada por talentosos científicos de polímeros y amplias capacidades de investigación.",
  "es:Rigorous quality control procedures with comprehensive testing ensuring consistent, high-quality outputs.": "Procedimientos rigurosos de control de calidad con pruebas integrales que aseguran resultados consistentes y de alta calidad.",
  "es:A Division of": "Una División de",
  "es:Spring Bank Mills": "Spring Bank Mills",
  "es:Sowerby Bridge": "Sowerby Bridge",
  "es:West Yorkshire HX6 3BW": "West Yorkshire HX6 3BW",
  "es:United Kingdom": "Reino Unido",
  "es:UV Stable • Non-Toxic • 21 Colours • UK Made": "Estable a rayos UV • No Tóxico • 21 Colores • Hecho en Reino Unido",
  "es:© 2025 Rosehill Sports & Play. A Division of": "© 2025 Rosehill Sports & Play. Una División de",
  "es:. All rights reserved. |": ". Todos los derechos reservados. |",
  "es:We use cookies to enhance your browsing experience and analyse our traffic. You can choose which cookies to allow below.": "Utilizamos cookies para mejorar tu experiencia de navegación y analizar nuestro tráfico. Puedes elegir qué cookies permitir a continuación.",
  "es:These cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you.": "Estas cookies son necesarias para que el sitio web funcione y no se pueden desactivar. Generalmente solo se establecen en respuesta a acciones realizadas por ti.",
  "es:These cookies help us understand how visitors interact with our website by collecting and reporting information anonymously via Google Analytics.": "Estas cookies nos ayudan a entender cómo los visitantes interactúan con nuestro sitio web recopilando e informando información de forma anónima a través de Google Analytics.",
  "es:Premium virgin polymers - no sulphur, clay fillers, or heavy metals": "Polímeros vírgenes de primera calidad - sin azufre, rellenos de arcilla o metales pesados",
  "es:Remarkable thermal stability with no carbon black leaching": "Notable estabilidad térmica sin lixiviación de negro de carbón",
  "es:Maintains suppleness under harsh UV conditions": "Mantiene la flexibilidad bajo condiciones severas de rayos UV",
  "es:Superior colour consistency across all 21 vibrant colours": "Consistencia de color superior en los 21 colores vibrantes",
  "es:Enhanced UV stability compared to EPDM and SBR granules": "Estabilidad UV mejorada en comparación con gránulos EPDM y SBR",
  "es:Custom colour blending service available": "Servicio de mezcla de colores personalizado disponible",
  "es:30+ years of MDI polyurethane binder development": "Más de 30 años de desarrollo de aglutinantes de poliuretano MDI",
  "es:Solutions for all climates and conditions": "Soluciones para todos los climas y condiciones",
  "es:Hot and cold moulding applications": "Aplicaciones de moldeo en caliente y en frío",
  "es:Complete system including cleaners and primers": "Sistema completo incluyendo limpiadores e imprimaciones",
  "es:Proven performance in demanding environments": "Rendimiento comprobado en entornos exigentes",
  "es:Technical support and guidance included": "Soporte técnico y orientación incluidos",
  "es:Accept All": "Aceptar Todo",
  "es:Essential Only": "Solo Esenciales",
  "es:Save Settings": "Guardar Configuración",
  "es:Colour": "Color",
  "es:Installations": "Instalaciones",
  "es:About Us": "Acerca de Nosotros",
  "es:Get in Touch": "Ponerse en Contacto",
  "es:Explore Products": "Explorar Productos",
  "es:Colour Mixer": "Mezclador de Colores",
  "es:View Product Details": "Ver Detalles del Producto",
  "es:Learn More": "Aprender Más",
  "es:View All Installations": "Ver Todas las Instalaciones",
  "es:Request Samples": "Solicitar Muestras",
  "es:View Colour Chart": "Ver Tabla de Colores",
  "es:Rosehill Group": "Grupo Rosehill",
  "es:+44 (0)1422 839 456": "+44 (0)1422 839 456",
  "es:info@rosehilltpv.com": "info@rosehilltpv.com",
  "es:Granules": "Gránulos",
  "es:21 Vibrant Colours": "21 Colores Vibrantes",
  "es:Custom Colour Blends": "Mezclas de Colores Personalizadas",
  "es:Sports Surfaces": "Superficies Deportivas",
  "es:Play Areas": "Áreas de Juego",
  "es:Athletic Tracks": "Pistas Atléticas",
  "es:Safety Surfacing": "Pavimentación de Seguridad",
  "es:Colour Options": "Opciones de Color",
  "fr:Durable. Reliable.": "Durable. Fiable.",
  "fr:Rosehill TPV - Sports & Recreation Surfaces": "Rosehill TPV - Surfaces sportives et récréatives",
  "fr:Rosehill TPV": "Rosehill TPV",
  "fr:Flexilon® Binders": "Reliures Flexilon",
  "fr:Rosehill TPV Granules": "Rosehill TPV Granules",
  "fr:Premium Rosehill TPV® rubber granules and Flexilon® binders for sports and recreation surfaces. Durable, reliable, UV stable solutions for playgrounds, MUGAs, tracks and more.": "Granulés de caoutchouc TPV® Rosehill de première qualité et liants Flexilon® pour les surfaces sportives et récréatives. Solutions durables, fiables et stables aux UV pour les aires de jeux, les terrains de sport, les pistes et bien plus encore.",
  "fr:UV Stable.": "Stable aux UV.",
  "fr:Our Products": "Nos produits",
  "fr:Applications": "Applications",
  "fr:Latest Installations": "Dernières installations",
  "fr:About Rosehill Sports & Play": "À propos de Rosehill Sports & Play",
  "fr:Ready to create exceptional surfaces?": "Prêt à créer des surfaces exceptionnelles ?",
  "fr:Flexilon": "Flexilon",
  "fr:Binders": "Reliures",
  "fr:Playground Surfaces": "Surfaces d'aires de jeux",
  "fr:Multi-Use Games Areas": "Aires de jeux à usages multiples",
  "fr:Running Tracks": "Pistes de course",
  "fr:Sports Pitches": "Terrains de sport",
  "fr:Footpaths": "Chemins de randonnée",
  "fr:Splash Parks": "Parcs à éclaboussures",
  "fr:UK Manufacturing": "Industrie manufacturière britannique",
  "fr:Global Recognition": "Reconnaissance mondiale",
  "fr:Innovation & R&D": "Innovation et R&D",
  "fr:Quality Assured": "Qualité assurée",
  "fr:Contact Us": "Nous contacter",
  "fr:Company": "Entreprise",
  "fr:Cookie Settings": "Paramètres des cookies",
  "fr:Essential Cookies": "Biscuits essentiels",
  "fr:Analytics Cookies": "Cookies analytiques",
  "fr:Rosehill TPV® combines durability, reliability, and UV stability to create high-quality, long-lasting surfaces.": "Rosehill TPV® allie durabilité, fiabilité et stabilité aux UV pour créer des surfaces de haute qualité et durables.",
  "fr:Cutting-edge solutions manufactured in the UK using premium virgin polymers": "Des solutions de pointe fabriquées au Royaume-Uni à partir de polymères vierges de première qualité",
  "fr:Cutting-edge, elastomer-based coloured rubber granules manufactured in the United Kingdom. Our unique, 100% fully cross-linked and non-porous granules are polypropylene-free and non-spherical.": "Granulés de caoutchouc colorés à base d'élastomère fabriqués au Royaume-Uni. Nos granulés uniques, entièrement réticulés et non poreux, sont exempts de polypropylène et non sphériques.",
  "fr:Comprehensive range of cleaners, primers, binders, catalysts and pigments for both hot and cold moulding applications. With over 30 years of experience developing MDI polyurethane binders, our Flexilon® range offers solutions for every climate and condition.": "Gamme complète de nettoyants, d'apprêts, de liants, de catalyseurs et de pigments pour les applications de moulage à chaud et à froid. Avec plus de 30 ans d'expérience dans le développement de liants polyuréthane MDI, notre gamme Flexilon® offre des solutions pour tous les climats et toutes les conditions.",
  "fr:Versatile solutions for sports, recreation, and safety surfacing across diverse environments": "Solutions polyvalentes pour les sports, les loisirs et les revêtements de sécurité dans divers environnements",
  "fr:Safe, non-slip surfaces for children's play areas with excellent impact absorption and vibrant colour options.": "Surfaces sûres et antidérapantes pour les aires de jeux des enfants, avec une excellente absorption des chocs et des options de couleurs vives.",
  "fr:Durable court surfaces suitable for basketball, tennis, netball and other sports with superior UV resistance.": "Surfaces durables adaptées au basket-ball, au tennis, au netball et à d'autres sports, avec une résistance supérieure aux UV.",
  "fr:High-performance athletic track surfaces providing optimal grip, comfort, and longevity for competitive sports.": "Surfaces de pistes d'athlétisme haute performance offrant une adhérence, un confort et une longévité optimaux pour les sports de compétition.",
  "fr:Synthetic turf and pitch surfaces with excellent drainage and consistent playing characteristics year-round.": "Des surfaces de gazon et de terrains synthétiques dotées d'un excellent drainage et de caractéristiques de jeu constantes tout au long de l'année.",
  "fr:Slip-resistant pathway surfaces ideal for parks, trails, and public spaces with low maintenance requirements.": "Surfaces antidérapantes idéales pour les parcs, les sentiers et les espaces publics, nécessitant peu d'entretien.",
  "fr:Water-resistant surfaces perfect for water play areas, providing safety and comfort in wet conditions.": "Surfaces résistantes à l'eau, parfaites pour les aires de jeux aquatiques, offrant sécurité et confort dans des conditions humides.",
  "fr:Discover our recent projects showcasing TPV surfaces worldwide": "Découvrez nos projets récents présentant des surfaces TPV dans le monde entier",
  "fr:Loading latest installations...": "Chargement des dernières installations...",
  "fr:Market-leading manufacturer with global recognition and trust": "Fabricant leader sur le marché bénéficiant d'une reconnaissance et d'une confiance mondiales",
  "fr:State-of-the-art facilities in Yorkshire using unique polyurethane chemistry, tailor-made for the toughest environments.": "Installations de pointe dans le Yorkshire utilisant une chimie de polyuréthane unique, conçue sur mesure pour les environnements les plus difficiles.",
  "fr:Specified by architects and designers worldwide, from Olympic Games venues to Disney, Sea World, and Universal Studios.": "Spécifié par les architectes et les concepteurs du monde entier, des sites des Jeux olympiques à Disney, Sea World et Universal Studios.",
  "fr:Continuous innovation driven by talented polymer scientists and extensive research capabilities.": "Une innovation continue grâce à des scientifiques talentueux spécialisés dans les polymères et à des capacités de recherche étendues.",
  "fr:Rigorous quality control procedures with comprehensive testing ensuring consistent, high-quality outputs.": "Des procédures rigoureuses de contrôle de la qualité avec des tests complets garantissent des résultats cohérents et de haute qualité.",
  "fr:A Division of": "Une division de",
  "fr:Spring Bank Mills": "Moulins de Spring Bank",
  "fr:Sowerby Bridge": "Sowerby Bridge",
  "fr:West Yorkshire HX6 3BW": "West Yorkshire HX6 3BW",
  "fr:United Kingdom": "Royaume-Uni",
  "fr:UV Stable • Non-Toxic • 21 Colours • UK Made": "Stable aux UV - Non toxique - 21 couleurs - Fabriqué au Royaume-Uni",
  "fr:© 2025 Rosehill Sports & Play. A Division of": "2025 Rosehill Sports & Play. Une division de",
  "fr:. All rights reserved. |": ". Tous droits réservés. |",
  "fr:We use cookies to enhance your browsing experience and analyse our traffic. You can choose which cookies to allow below.": "Nous utilisons des cookies pour améliorer votre expérience de navigation et analyser notre trafic. Vous pouvez choisir les cookies que vous souhaitez autoriser ci-dessous.",
  "fr:These cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you.": "Ces cookies sont nécessaires au fonctionnement du site web et ne peuvent pas être désactivés. Ils ne sont généralement installés qu'en réponse à des actions que vous avez effectuées.",
  "fr:These cookies help us understand how visitors interact with our website by collecting and reporting information anonymously via Google Analytics.": "Ces cookies nous aident à comprendre comment les visiteurs interagissent avec notre site web en collectant et en rapportant des informations de manière anonyme via Google Analytics.",
  "fr:Premium virgin polymers - no sulphur, clay fillers, or heavy metals": "Polymères vierges de première qualité - sans soufre, sans argile ni métaux lourds",
  "fr:Remarkable thermal stability with no carbon black leaching": "Stabilité thermique remarquable sans lixiviation du noir de carbone",
  "fr:Maintains suppleness under harsh UV conditions": "Conserve sa souplesse dans des conditions d'exposition aux UV difficiles",
  "fr:Superior colour consistency across all 21 vibrant colours": "Cohérence supérieure des couleurs sur l'ensemble des 21 couleurs vives",
  "fr:Enhanced UV stability compared to EPDM and SBR granules": "Stabilité aux UV améliorée par rapport aux granulés EPDM et SBR",
  "fr:Custom colour blending service available": "Service de mélange de couleurs personnalisé disponible",
  "fr:30+ years of MDI polyurethane binder development": "Plus de 30 ans de développement de liants polyuréthanes MDI",
  "fr:Solutions for all climates and conditions": "Des solutions pour tous les climats et toutes les conditions",
  "fr:Hot and cold moulding applications": "Applications de moulage à chaud et à froid",
  "fr:Complete system including cleaners and primers": "Système complet comprenant des nettoyants et des apprêts",
  "fr:Proven performance in demanding environments": "Des performances éprouvées dans des environnements exigeants",
  "fr:Technical support and guidance included": "Assistance technique et conseils inclus",
  "fr:Accept All": "Tout accepter",
  "fr:Essential Only": "Essentiel seulement",
  "fr:Save Settings": "Sauvegarder les paramètres",
  "fr:Colour": "Couleur",
  "fr:Installations": "Installations",
  "fr:About Us": "À propos de nous",
  "fr:Get in Touch": "Prendre contact",
  "fr:Explore Products": "Explorer les produits",
  "fr:Colour Mixer": "Mélangeur de couleurs",
  "fr:View Product Details": "Voir les détails du produit",
  "fr:Learn More": "En savoir plus",
  "fr:View All Installations": "Voir toutes les installations",
  "fr:Request Samples": "Demande d'échantillons",
  "fr:View Colour Chart": "Voir le nuancier",
  "fr:Rosehill Group": "Groupe Rosehill",
  "fr:+44 (0)1422 839 456": "+44 (0)1422 839 456",
  "fr:info@rosehilltpv.com": "info@rosehilltpv.com",
  "fr:Granules": "Granulés",
  "fr:21 Vibrant Colours": "21 couleurs vibrantes",
  "fr:Custom Colour Blends": "Mélanges de couleurs personnalisés",
  "fr:Sports Surfaces": "Surfaces sportives",
  "fr:Play Areas": "Aires de jeux",
  "fr:Athletic Tracks": "Pistes athlétiques",
  "fr:Safety Surfacing": "Revêtement de sécurité",
  "fr:Colour Options": "Options de couleurs",
  "de:Rosehill TPV Granules": "Rosehill TPV-Granulat",
  "de:Premium Rosehill TPV® rubber granules and Flexilon® binders for sports and recreation surfaces. Durable, reliable, UV stable solutions for playgrounds, MUGAs, tracks and more.": "Hochwertiges Rosehill TPV®-Gummigranulat und Flexilon®-Bindemittel für Sport- und Freizeitflächen. Langlebige, zuverlässige, UV-stabile Lösungen für Spielplätze, MUGAs, Laufbahnen und mehr.",
  "de:Flexilon® Binders": "Flexilon®-Bindemittel",
  "de:Rosehill TPV - Sports & Recreation Surfaces": "Rosehill TPV - Sport- und Erholungsbeläge",
  "de:Rosehill TPV": "Rosehill TPV",
  "de:Durable. Reliable.": "Langlebig. Zuverlässig.",
  "de:UV Stable.": "UV-stabil.",
  "de:Our Products": "Unsere Produkte",
  "de:Applications": "Anwendungen",
  "de:Latest Installations": "Letzte Installationen",
  "de:About Rosehill Sports & Play": "Über Rosehill Sports & Play",
  "de:Ready to create exceptional surfaces?": "Sind Sie bereit, außergewöhnliche Oberflächen zu schaffen?",
  "de:Flexilon": "Flexilon",
  "de:Binders": "Bindemittel",
  "de:Playground Surfaces": "Spielplatz-Oberflächen",
  "de:Multi-Use Games Areas": "Multi-Use-Spielbereiche",
  "de:Running Tracks": "Laufspuren",
  "de:Sports Pitches": "Sportplätze",
  "de:Footpaths": "Fußwege",
  "de:Splash Parks": "Spritzwasserparks",
  "de:UK Manufacturing": "UK Fertigung",
  "de:Global Recognition": "Globale Anerkennung",
  "de:Innovation & R&D": "Innovation und F&E",
  "de:Quality Assured": "Gesicherte Qualität",
  "de:Contact Us": "Kontakt",
  "de:Company": "Unternehmen",
  "de:Cookie Settings": "Cookie-Einstellungen",
  "de:Essential Cookies": "Unverzichtbare Cookies",
  "de:Analytics Cookies": "Analyse-Cookies",
  "de:Rosehill TPV® combines durability, reliability, and UV stability to create high-quality, long-lasting surfaces.": "Rosehill TPV® kombiniert Beständigkeit, Zuverlässigkeit und UV-Stabilität, um hochwertige, langlebige Oberflächen zu schaffen.",
  "de:Cutting-edge solutions manufactured in the UK using premium virgin polymers": "Hochmoderne Lösungen, die im Vereinigten Königreich unter Verwendung hochwertiger neuer Polymere hergestellt werden",
  "de:Cutting-edge, elastomer-based coloured rubber granules manufactured in the United Kingdom. Our unique, 100% fully cross-linked and non-porous granules are polypropylene-free and non-spherical.": "Hochmodernes, gefärbtes Gummigranulat auf Elastomerbasis, das im Vereinigten Königreich hergestellt wird. Unser einzigartiges, zu 100 % vollständig vernetztes und porenfreies Granulat ist polypropylenfrei und nicht kugelförmig.",
  "de:Comprehensive range of cleaners, primers, binders, catalysts and pigments for both hot and cold moulding applications. With over 30 years of experience developing MDI polyurethane binders, our Flexilon® range offers solutions for every climate and condition.": "Umfassendes Angebot an Reinigern, Grundierungen, Bindemitteln, Katalysatoren und Pigmenten für Heiß- und Kaltformanwendungen. Mit über 30 Jahren Erfahrung in der Entwicklung von MDI-Polyurethan-Bindemitteln bietet unser Flexilon®-Sortiment Lösungen für jedes Klima und jede Bedingung.",
  "de:Versatile solutions for sports, recreation, and safety surfacing across diverse environments": "Vielseitige Lösungen für Sport-, Freizeit- und Sicherheitsbeläge in unterschiedlichen Umgebungen",
  "de:Safe, non-slip surfaces for children's play areas with excellent impact absorption and vibrant colour options.": "Sichere, rutschfeste Oberflächen für Kinderspielplätze mit hervorragender Stoßdämpfung und lebhaften Farboptionen.",
  "de:Durable court surfaces suitable for basketball, tennis, netball and other sports with superior UV resistance.": "Strapazierfähiger Platzbelag für Basketball, Tennis, Netzball und andere Sportarten mit hervorragender UV-Beständigkeit.",
  "de:High-performance athletic track surfaces providing optimal grip, comfort, and longevity for competitive sports.": "Leistungsstarke Leichtathletikbeläge, die optimale Griffigkeit, Komfort und Langlebigkeit für den Leistungssport bieten.",
  "de:Synthetic turf and pitch surfaces with excellent drainage and consistent playing characteristics year-round.": "Synthetische Rasen- und Spielfeldoberflächen mit ausgezeichneter Drainage und ganzjährig gleichmäßigen Spieleigenschaften.",
  "de:Slip-resistant pathway surfaces ideal for parks, trails, and public spaces with low maintenance requirements.": "Rutschfeste Wegebeläge, ideal für Parks, Wege und öffentliche Plätze mit geringem Pflegeaufwand.",
  "de:Water-resistant surfaces perfect for water play areas, providing safety and comfort in wet conditions.": "Wasserfeste Oberflächen, die sich perfekt für Wasserspielplätze eignen und Sicherheit und Komfort bei Nässe bieten.",
  "de:Discover our recent projects showcasing TPV surfaces worldwide": "Entdecken Sie unsere aktuellen Projekte, die TPV-Oberflächen weltweit präsentieren",
  "de:Loading latest installations...": "Laden der neuesten Installationen...",
  "de:Market-leading manufacturer with global recognition and trust": "Marktführender Hersteller mit weltweiter Anerkennung und Vertrauen",
  "de:State-of-the-art facilities in Yorkshire using unique polyurethane chemistry, tailor-made for the toughest environments.": "Hochmoderne Anlagen in Yorkshire, die eine einzigartige Polyurethanchemie verwenden, die für die härtesten Umgebungen maßgeschneidert ist.",
  "de:Specified by architects and designers worldwide, from Olympic Games venues to Disney, Sea World, and Universal Studios.": "Sie werden von Architekten und Designern auf der ganzen Welt eingesetzt, von den Austragungsorten der Olympischen Spiele bis hin zu Disney, Sea World und den Universal Studios.",
  "de:Continuous innovation driven by talented polymer scientists and extensive research capabilities.": "Kontinuierliche Innovation durch talentierte Polymerwissenschaftler und umfangreiche Forschungskapazitäten.",
  "de:Rigorous quality control procedures with comprehensive testing ensuring consistent, high-quality outputs.": "Strenge Qualitätskontrollverfahren mit umfassenden Tests gewährleisten gleichbleibend hochwertige Ergebnisse.",
  "de:A Division of": "Eine Abteilung von",
  "de:Spring Bank Mills": "Spring Bank Mills",
  "de:Sowerby Bridge": "Sowerby-Brücke",
  "de:West Yorkshire HX6 3BW": "West Yorkshire HX6 3BW",
  "de:United Kingdom": "Vereinigtes Königreich",
  "de:UV Stable • Non-Toxic • 21 Colours • UK Made": "UV-stabil - ungiftig - 21 Farben - UK Made",
  "de:© 2025 Rosehill Sports & Play. A Division of": "© 2025 Rosehill Sports & Play. Eine Abteilung von",
  "de:. All rights reserved. |": ". Alle Rechte vorbehalten. |",
  "de:We use cookies to enhance your browsing experience and analyse our traffic. You can choose which cookies to allow below.": "Wir verwenden Cookies, um Ihr Surferlebnis zu verbessern und unseren Datenverkehr zu analysieren. Sie können unten auswählen, welche Cookies Sie zulassen möchten.",
  "de:These cookies are necessary for the website to function and cannot be switched off. They are usually only set in response to actions made by you.": "Diese Cookies sind für das Funktionieren der Website erforderlich und können nicht abgeschaltet werden. Sie werden in der Regel nur als Reaktion auf Aktionen von Ihnen gesetzt.",
  "de:These cookies help us understand how visitors interact with our website by collecting and reporting information anonymously via Google Analytics.": "Diese Cookies helfen uns zu verstehen, wie Besucher mit unserer Website interagieren, indem sie Informationen anonym über Google Analytics sammeln und berichten.",
  "de:Premium virgin polymers - no sulphur, clay fillers, or heavy metals": "Hochwertige, reine Polymere - ohne Schwefel, Tonfüllstoffe oder Schwermetalle",
  "de:Remarkable thermal stability with no carbon black leaching": "Bemerkenswerte thermische Stabilität ohne Auslaugung von Ruß",
  "de:Maintains suppleness under harsh UV conditions": "Erhält die Geschmeidigkeit unter harten UV-Bedingungen",
  "de:Superior colour consistency across all 21 vibrant colours": "Hervorragende Farbkonsistenz in allen 21 leuchtenden Farben",
  "de:Enhanced UV stability compared to EPDM and SBR granules": "Verbesserte UV-Stabilität im Vergleich zu EPDM- und SBR-Granulaten",
  "de:Custom colour blending service available": "Individuelle Farbmischung möglich",
  "de:30+ years of MDI polyurethane binder development": "Mehr als 30 Jahre Erfahrung in der Entwicklung von MDI-Polyurethan-Bindemitteln",
  "de:Solutions for all climates and conditions": "Lösungen für alle Klimazonen und Bedingungen",
  "de:Hot and cold moulding applications": "Heiß- und Kaltgießanwendungen",
  "de:Complete system including cleaners and primers": "Komplettsystem mit Reinigern und Primern",
  "de:Proven performance in demanding environments": "Bewährte Leistung in anspruchsvollen Umgebungen",
  "de:Technical support and guidance included": "Technische Unterstützung und Anleitung inklusive",
  "de:Accept All": "Alle akzeptieren",
  "de:Essential Only": "Nur Wesentliches",
  "de:Save Settings": "Einstellungen speichern",
  "de:Colour": "Farbe",
  "de:Installations": "Installationen",
  "de:About Us": "Über uns",
  "de:Get in Touch": "Kontakt aufnehmen",
  "de:Explore Products": "Produkte erforschen",
  "de:Colour Mixer": "Farbmischer",
  "de:View Product Details": "Details zum Produkt anzeigen",
  "de:Learn More": "Mehr erfahren",
  "de:View All Installations": "Alle Installationen anzeigen",
  "de:Request Samples": "Muster anfordern",
  "de:View Colour Chart": "Farbtabelle ansehen",
  "de:Rosehill Group": "Rosehill-Gruppe",
  "de:+44 (0)1422 839 456": "+44 (0)1422 839 456",
  "de:info@rosehilltpv.com": "info@rosehilltpv.com",
  "de:Granules": "Granulat",
  "de:21 Vibrant Colours": "21 leuchtende Farben",
  "de:Custom Colour Blends": "Individuelle Farbmischungen",
  "de:Sports Surfaces": "Sportoberflächen",
  "de:Play Areas": "Spielbereiche",
  "de:Athletic Tracks": "Leichtathletik-Strecken",
  "de:Safety Surfacing": "Sicherheitsbeläge",
  "de:Colour Options": "Farboptionen",
  "fr:Flexilon® Binder Selector": "Sélecteur d'Aglutinant Flexilon®",
  "de:Flexilon® Binder Selector": "Flexilon® Bindemittel-Selektor",
  "es:Flexilon® Binder Selector": "Selector de Aglutinante Flexilon®",
  "fr:Find the perfect binder for your project requirements. Complete each step in order - each selection will unlock the next step and show only compatible options.": "Trouvez l'aglutinant parfait pour les exigences de votre projet. Complétez chaque étape dans l'ordre - chaque sélection débloquera l'étape suivante et ne montrera que les options compatibles.",
  "de:Find the perfect binder for your project requirements. Complete each step in order - each selection will unlock the next step and show only compatible options.": "Finden Sie das perfekte Bindemittel für Ihre Projektanforderungen. Vervollständigen Sie jeden Schritt in der richtigen Reihenfolge - jede Auswahl schaltet den nächsten Schritt frei und zeigt nur kompatible Optionen.",
  "es:Find the perfect binder for your project requirements. Complete each step in order - each selection will unlock the next step and show only compatible options.": "Encuentra el aglutinante perfecto para los requisitos de tu proyecto. Completa cada paso en orden - cada selección desbloqueará el siguiente paso y mostrará solo opciones compatibles.",
  "fr:Climate": "Climat",
  "de:Climate": "Klima",
  "es:Climate": "Clima",
  "fr:Application": "Application",
  "de:Application": "Anwendung",
  "es:Application": "Aplicación",
  "fr:Surface": "Surface",
  "de:Surface": "Oberfläche",
  "es:Surface": "Superficie",
  "fr:Cure Speed": "Vitesse de Durcissement",
  "de:Cure Speed": "Aushärtungsgeschwindigkeit",
  "es:Cure Speed": "Velocidad de Curado",
  "fr:Climate Conditions": "Conditions Climatiques",
  "de:Climate Conditions": "Klimabedingungen",
  "es:Climate Conditions": "Condiciones Climáticas",
  "fr:Select climate...": "Sélectionnez le climat...",
  "de:Select climate...": "Klima auswählen...",
  "es:Select climate...": "Seleccionar clima...",
  "fr:Cold Climate (< 15°C average)": "Climat Froid (< 15°C en moyenne)",
  "de:Cold Climate (< 15°C average)": "Kaltes Klima (< 15°C Durchschnitt)",
  "es:Cold Climate (< 15°C average)": "Clima Frío (< 15°C promedio)",
  "fr:Temperate Climate (15-25°C average)": "Climat Tempéré (15-25°C en moyenne)",
  "de:Temperate Climate (15-25°C average)": "Gemäßigtes Klima (15-25°C Durchschnitt)",
  "es:Temperate Climate (15-25°C average)": "Clima Templado (15-25°C promedio)",
  "fr:Warm Climate (25-35°C average)": "Climat Chaud (25-35°C en moyenne)",
  "de:Warm Climate (25-35°C average)": "Warmes Klima (25-35°C Durchschnitt)",
  "es:Warm Climate (25-35°C average)": "Clima Cálido (25-35°C promedio)",
  "fr:Very Warm Climate (> 35°C average)": "Climat Très Chaud (> 35°C en moyenne)",
  "de:Very Warm Climate (> 35°C average)": "Sehr Warmes Klima (> 35°C Durchschnitt)",
  "es:Very Warm Climate (> 35°C average)": "Clima Muy Cálido (> 35°C promedio)",
  "fr:Mixed Climate (Variable temperatures)": "Climat Mixte (Températures variables)",
  "de:Mixed Climate (Variable temperatures)": "Gemischtes Klima (Variable Temperaturen)",
  "es:Mixed Climate (Variable temperatures)": "Clima Mixto (Temperaturas variables)",
  "fr:Application Method": "Méthode d'Application",
  "de:Application Method": "Anwendungsmethode",
  "es:Application Method": "Método de Aplicación",
  "fr:Select application method...": "Sélectionnez la méthode d'application...",
  "de:Select application method...": "Anwendungsmethode auswählen...",
  "es:Select application method...": "Seleccionar método de aplicación...",
  "fr:Wet Pour Installation": "Installation par Coulée Humide",
  "de:Wet Pour Installation": "Nassguss-Installation",
  "es:Wet Pour Installation": "Instalación por Vertido Húmedo",
  "fr:Paver Machine Installation": "Installation par Machine à Paver",
  "de:Paver Machine Installation": "Pflastermaschinen-Installation",
  "es:Paver Machine Installation": "Instalación con Máquina Pavimentadora",
  "fr:Compression Moulding": "Moulage par Compression",
  "de:Compression Moulding": "Spritzguss",
  "es:Compression Moulding": "Moldeo por Compresión",
  "fr:21 Vibrant Colours\nEndless Possibilities": "21 Couleurs Vibrantes\nPossibilités Infinies",
  "de:21 Vibrant Colours\nEndless Possibilities": "21 Lebendige Farben\nUnendliche Möglichkeiten",
  "es:21 Vibrant Colours\nEndless Possibilities": "21 Colores Vibrantes\nPosibilidades Infinitas",
  "fr:From subtle single-colour installations to dynamic custom blends,\nour UV-stable TPV granules deliver lasting vibrancy.": "Des installations monochromes subtiles aux mélanges personnalisés dynamiques,\nnos granulés TPV stables aux UV offrent une vivacité durable.",
  "de:From subtle single-colour installations to dynamic custom blends,\nour UV-stable TPV granules deliver lasting vibrancy.": "Von subtilen einfarbigen Installationen bis hin zu dynamischen, maßgeschneiderten Mischungen\nliefern unsere UV-stabilen TPV-Granulate dauerhafte Lebendigkeit.",
  "es:From subtle single-colour installations to dynamic custom blends,\nour UV-stable TPV granules deliver lasting vibrancy.": "Desde instalaciones sutiles de un solo color hasta mezclas personalizadas dinámicas,\nnuestros gránulos TPV estables a los rayos UV ofrecen vitalidad duradera.",
  "fr:Surfaces come alive when multiple colours are expertly blended. From subtle two-tone combinations to dynamic multi-colour patterns, our custom blending service allows architects and designers to create truly unique installations.": "Les surfaces prennent vie lorsque plusieurs couleurs sont expertement mélangées. Des combinaisons bicolores subtiles aux motifs multicolores dynamiques, notre service de mélange personnalisé permet aux architectes et designers de créer des installations vraiment uniques.",
  "de:Surfaces come alive when multiple colours are expertly blended. From subtle two-tone combinations to dynamic multi-colour patterns, our custom blending service allows architects and designers to create truly unique installations.": "Oberflächen werden lebendig, wenn mehrere Farben fachmännisch gemischt werden. Von subtilen zweifarbigen Kombinationen bis hin zu dynamischen mehrfarbigen Mustern ermöglicht unser maßgeschneiderter Mischservice Architekten und Designern die Schaffung wirklich einzigartiger Installationen.",
  "es:Surfaces come alive when multiple colours are expertly blended. From subtle two-tone combinations to dynamic multi-colour patterns, our custom blending service allows architects and designers to create truly unique installations.": "Las superficies cobran vida cuando múltiples colores se mezclan expertamente. Desde combinaciones sutiles de dos tonos hasta patrones dinámicos multicolores, nuestro servicio de mezcla personalizada permite a arquitectos y diseñadores crear instalaciones verdaderamente únicas.",
  "fr:Each blend is precisely formulated using percentage ratios of our standard colours, ensuring consistent results and reproducible specifications for your projects.": "Chaque mélange est précisément formulé en utilisant des ratios de pourcentage de nos couleurs standards, garantissant des résultats cohérents et des spécifications reproductibles pour vos projets.",
  "de:Each blend is precisely formulated using percentage ratios of our standard colours, ensuring consistent results and reproducible specifications for your projects.": "Jede Mischung wird präzise unter Verwendung von Prozentverhältnissen unserer Standardfarben formuliert, um konsistente Ergebnisse und reproduzierbare Spezifikationen für Ihre Projekte zu gewährleisten.",
  "es:Each blend is precisely formulated using percentage ratios of our standard colours, ensuring consistent results and reproducible specifications for your projects.": "Cada mezcla está formulada con precisión utilizando ratios porcentuales de nuestros colores estándar, asegurando resultados consistentes y especificaciones reproducibles para sus proyectos.",
  "fr:Ready to Specify Your Colours?": "Prêt à Spécifier Vos Couleurs ?",
  "de:Ready to Specify Your Colours?": "Bereit, Ihre Farben zu Spezifizieren?",
  "es:Ready to Specify Your Colours?": "¿Listo para Especificar Sus Colores?",
  "fr:Our technical team can help you select the perfect colours and blends for your project, providing samples and specification support.": "Notre équipe technique peut vous aider à sélectionner les couleurs et mélanges parfaits pour votre projet, en fournissant des échantillons et un support de spécification.",
  "de:Our technical team can help you select the perfect colours and blends for your project, providing samples and specification support.": "Unser technisches Team kann Ihnen bei der Auswahl der perfekten Farben und Mischungen für Ihr Projekt helfen und Muster sowie Spezifikationsunterstützung bereitstellen.",
  "es:Our technical team can help you select the perfect colours and blends for your project, providing samples and specification support.": "Nuestro equipo técnico puede ayudarle a seleccionar los colores y mezclas perfectos para su proyecto, proporcionando muestras y soporte de especificación.",
  "fr:Our Services": "Nos Services",
  "de:Our Services": "Unsere Dienstleistungen",
  "es:Our Services": "Nuestros Servicios",
  "fr:Support": "Support",
  "de:Support": "Support",
  "es:Support": "Soporte",
  "fr:Quality & Innovation": "Qualité et Innovation",
  "de:Quality & Innovation": "Qualität und Innovation",
  "es:Quality & Innovation": "Calidad e Innovación",
  "fr:Binder Selection Tool": "Outil de Sélection d'Aglutinant",
  "de:Binder Selection Tool": "Bindemittel-Auswahlwerkzeug",
  "es:Binder Selection Tool": "Herramienta de Selección de Aglutinante"
}