{
  "installations": [
    {
      "title": "Full Renovation Of Memorial Park Playground",
      "location": "Donald, Australia",
      "date": "2024-01-05",
      "application": "muga",
      "description": [
        "In the small Australian town of Donald, the Memorial Park playground has been fully renovated to include new play equipment and a stand-out Rosehill TPV® softfall surface. This new wetpour surface means that children can play safely and comfortably on the playground, without worrying about injuries or falls.",
        "Rosehill TPV® rubber granules are perfect for making softfall surfaces that last long and stay safe. Whether it’s for playgrounds, fitness areas, or MUGAs, our pour-in-place rubber is UV stable so surfaces retain their colour and softness.",
        "We offer a variety of 22 colours that can be mixed and matched to create custom shades and designs, enabling the creation of softfall surfaces that are both fun and safe for children.",
        "Thanks to Grange Surfacing and Surface Designs TPV"
      ],
      "images": [
        "1702950662589.jpeg",
        "1702942335713.jpeg",
        "1702942335947.jpeg",
        "1702950661736.jpeg"
      ]
    },
    {
      "title": "Rosehill TPV Softfall Surfacing At Campo Castelo Park",
      "location": "Spain",
      "date": "2024-01-08",
      "application": "playground",
      "description": [
        "Campo Castelo Park, nestled in the historic city of Lugo, Spain, has recently undergone a significant transformation. The renovation project breathed new life into the previously worn playground, turning it into an inviting and accessible space for both families and visitors to enjoy.",
        "Central to this refurbishment is the installation of a softfall surface made from blue Rosehill TPV®. This material is not only durable but also designed for safety, offering protection against injuries commonly associated with trips or falls. Its superior UV stability ensures that the vibrant colour and softness of the surface are maintained, even after prolonged exposure to harsh weather conditions.",
        "Rosehill TPV® is a versatile pour-in-place rubber, widely chosen for its practicality and visual appeal in community spaces and sports areas around the globe. Additionally, it is both safe and hypoallergenic, free from harmful substances, and meets the highest international standards for safety and environmental compliance.",
        "Thanks to VALORIZA ECORUBBER"
      ],
      "images": [
        "Campo_Castelo_1.2.jpeg",
        "Campo_Castelo_1.3.jpeg",
        "Campo_Castelo_1.1.jpeg"
      ]
    },
    {
      "title": "Community Play Area At Maunder Reserve",
      "location": "Guildford",
      "date": "2024-01-10",
      "application": "playground",
      "description": [
        "The community play area at Maunder Reserve in Guildford, Australia has undergone a recent renovation. The Rosehill TPV® surface offers a soft layer that reduces the impact of falls, while creating a safe and welcoming place for the local residents.",
        "Our pour-in-place rubber is a high-quality surfacing material that is used worldwide for a range of projects, including playgrounds, indoor areas, sport facilities and more. Rosehill TPV® is ideal for Australia’s extreme climate and intense UV rays, as it has unparalleled UV stability that preserves the softness and colour of the surfaces for longer.",
        "Rosehill TPV® offers 22 colours that can be used to create colourful designs that last longer. These designs are not only aesthetically pleasing, but also improve safety for children to explore freely.",
        "Thanks to Glooloop Surfacing Pty Ltd and Surface Designs TPV"
      ],
      "images": [
        "1702953344104.jpeg",
        "1702953338843.jpeg",
        "1702953333263.jpeg"
      ]
    },
    {
      "title": "Rosehill TPV Softfall Surfacing",
      "location": "Rosalie Park, Australia",
      "date": "2024-01-12",
      "application": "playground",
      "description": [
        "Rosalie Park is a large recreational space that’s popular with families and dog walkers, with a variety of sport pitches and facilities used by local clubs. This unique playground features rainbow themed steps leading up to a slide and doubles up as a fun interactive element.",
        "Rosehill TPV® provides a colourful softfall surface that protects against any accidents. Its unbeatable UV stability means it is perfect for outdoor areas, ensuring surfaces for playgrounds and sports areas, are safe even after long exposure to extreme environmental conditions.",
        "Create stunning, vibrant surfaces with Rosehill TPV®'s palette of 22 colours. Add motifs or enhance fun-filled play areas as Rosehill TPV® blends aesthetics and safety, whilst giving you the creative freedom to bring any vision to life.",
        "Thanks to Perth Playground &amp; Rubber and Surface Designs TPV"
      ],
      "images": [
        "1702616869643.jpeg",
        "1702616869631.jpeg"
      ]
    },
    {
      "title": "Recent Upgrade To The Play Area",
      "location": "Griffith Park, Sydney",
      "date": "2024-01-19",
      "application": "playground",
      "description": [
        "The local community around Griffith Park in the Sydney suburb of Collaroy will love the recent upgrade to the play area, which added Rosehill TPV® rubber softfall surfaces. Placed where accidents are likely, the cushioned surfaces will absorb the shock from slips, trips, or falls.",
        "Rosehill TPV® is a rubber surfacing solution that can be poured in place and is resistant to UV damage. It is ideal for Australia’s harsh climate, as it provides durable surfaces for playgrounds, games areas, splash parks, and more.",
        "Rosehill TPV® offers you an extensive palette of 22 colours, that can be mixed and matched in different shades to create stunning patterns or themes.",
        "Thanks to Australian Sports &amp; Safety Surfaces and Surface Designs TPV"
      ],
      "images": [
        "Griffith-Park-4.jpeg",
        "Griffith-Park-5.jpeg",
        "Griffith-Park-1.jpeg",
        "Griffith-Park-2.jpeg"
      ]
    },
    {
      "title": "Recent Renovation",
      "location": "Piney Lakes Sensory Playground",
      "date": "2024-01-17",
      "application": "playground",
      "description": [
        "Piney Lakes Sensory Playground in Winthrop, Australia has recently undergone a stunning transformation. The renovation introduced new play equipment and a softfall surface crafted from Rosehill TPV®, creating an inclusive, fun, and secure play area for children of all abilities.",
        "Rosehill TPV® is an ideal choice for playgrounds as it provides a cushioned surface that protects against slips, trips or falls. Unlike EPDM alternatives, our pour-in-place rubber has high UV stability to ensure surfaces stay safe and colourful regardless of exposure to harsh climates.",
        "Thanks to Perth Playground &amp; Rubber and Surface Designs TPV"
      ],
      "images": [
        "Piney_Lakes_Sensory_Playground3.jpeg",
        "Piney_Lakes_Sensory_Playground1.jpeg"
      ]
    },
    {
      "title": "Beach-Themed Play Area",
      "location": "Goomalling, Australia",
      "date": "2024-01-29",
      "application": "playground",
      "description": [
        "The skilled team at Perth Playground &amp; Rubber has recently completed the installation of a beach-themed play area in Goomalling, Australia, featuring Rosehill TPV® softfall surfacing. Employing a wet mixed blending technique, they've artfully created an ocean wave effect on the surface, adding visual depth while ensuring protection against common playground accidents.",
        "With Rosehill TPV®, any play area gets a soft layer that protects from slips, trips and falls. Our wetpour solution offers excellent UV stability and helps retain the surfaces colour and softness in any weather, making play spaces long-lasting and safe.",
        "Thanks to Perth Playground &amp; Rubber and Surface Designs TPV"
      ],
      "images": [
        "Goomalling_Playground_2.jpeg",
        "Goomalling_Playground_5.jpeg",
        "Goomalling_Playground_1.jpeg",
        "Goomalling_Playground_3.jpeg"
      ]
    },
    {
      "title": "Shopping Centre Play Area",
      "location": "Madrid, Spain",
      "date": "2024-02-05",
      "application": "playground",
      "description": [
        "A year of sun, weather, and play has not faded this vibrant Rosehill TPV® softfall surface at a shopping centre play area in Madrid. Installed by VALORIZA ECORUBBER, this surface cushions children from any slips, trips, or falls.",
        "Rosehill TPV® UV stability helps surfaces last longer and makes it ideal for use in Spain’s sunny climate. Suitable for both indoor and outdoor use, our pour-in-place rubber has been used all over the world for play areas in schools, parks, shopping centres, and more.",
        "Designing playgrounds with softfall surfaces is a complex and careful process. Choose from our 22 colours to make the perfect combination for any project, whether you want to match the surroundings or create a theme.",
        "Thanks to VALORIZA ECORUBBER"
      ],
      "images": [
        "Shopping_Centre_Madrid_3-scaled.jpeg",
        "Shopping_Centre_Madrid_2-scaled.jpeg",
        "Shopping_Centre_Madrid_4-scaled.jpeg"
      ]
    },
    {
      "title": "Playground Upgrade",
      "location": "Maunder Reserve In Guildford, Sydney",
      "date": "2024-02-09",
      "application": "playground",
      "description": [
        "In the residential suburb of Guildford, just west of Sydney central business district, the local community is enjoying the recent upgrades at Maunder Reserve.",
        "The new softfall surface features rich blends of Rosehill TPV® red and orange rubber, along with new playground equipment, and is designed to improve safety and cushion children from common playground mishaps.",
        "Rosehill TPV® is a unique surfacing material that is suitable for a range of applications including playgrounds, indoor spaces, sport venues and more. Its durability against Australia’s intense climate and UV exposure ensures long-lasting colour and texture retention, making it a favoured choice nationwide.",
        "Thanks to Glooloop Surfacing Pty Ltd and Surface Designs TPV"
      ],
      "images": [
        "1702953338828.jpeg",
        "1702953334190.jpeg",
        "1702953342062.jpeg"
      ]
    },
    {
      "title": "Rosehill TPV Softfall Surface Installed",
      "location": "Austin &amp; Mercy Hospital",
      "date": "2024-02-13",
      "application": "playground",
      "description": [
        "The softfall surface for Austin &amp; Mercy Hospital is complete! Careful design and planning went into creating a fun and safe area that would be an amazing space for children to relax and play. The Rosehill TPV® raised platforms and 3D shapes not only add more interactive elements to play with, but also provide a cushioning tactile surface that protects against any slips, trips, or falls.",
        "Rosehill TPV® pour-in-place rubber is a durable and excellent choice for softfall surfaces in Australia. It has unbeatable UV stability, so it keeps its colour and softness for longer even in unpredictable weather. Surface Designs TPV provides 3D animals and shapes that make play areas lively and interactive whilst helping children develop their balance and agility while having fun.",
        "We offer a range of 22 colours that can be easily combined to create bespoke blends for any project. Whether for a playground upgrade or private pool surrounds, Rosehill TPV® can be used to brighten up surfaces whilst prioritising safety!",
        "Thanks to Grange Surfacing and Surface Designs TPV"
      ],
      "images": [
        "Austin_Mercy_Hospital_3.jpeg",
        "Austin_Mercy_Hospital_2.jpeg",
        "Austin_Mercy_Hospital_4.jpeg"
      ]
    },
    {
      "title": "New Playground Installed",
      "location": "Glover Recreation Reserve",
      "date": "2024-02-20",
      "application": "tennis",
      "description": [
        "Glover Recreation Reserve, known for its vibrant sports field and club facilities, including tennis, cricket, and football, recently saw the installation of a new playground. Designed to harmonise with the natural environment, this playground offers a unified space for relaxation, catering to both playground visitors and sports enthusiasts.",
        "Rosehill TPV® softfall surfaces were strategically installed under equipment to provide cushioning protection against any trips or falls that may occur while children play.",
        "This UV-stable rubber surfacing solution ensures durability and colour retention, making it ideal for creating enduring play areas in any climate. Available in 22 colours, Rosehill TPV® offers endless possibilities for creative, themed, or nature-inspired designs, allowing for the blending of colours to achieve the perfect shade for any project.",
        "Thanks to Grange Surfacing and Surface Designs TPV"
      ],
      "images": [
        "Glover_Rec_Reserve_1.jpeg",
        "Glover_Rec_Reserve_2.jpeg",
        "Glover_Rec_Reserve_4.jpeg"
      ]
    },
    {
      "title": "Earth-Themed Play Space Located Outside Vall D'Hebron Children's Hospital",
      "location": "",
      "date": "2024-02-27",
      "application": "playground",
      "description": [
        "Món Parc is an earth-themed play space located outside Vall D’Hebron children’s hospital on the outskirts of Barcelona. It features a unique design with inclusive elements that provide a fun and imaginative space for all ages.",
        "The Rosehill TPV® softfall surface installed by ENZA SOLUCIONES Y SERVICIOS SL is designed to link together the different elements across the park, while providing a safe and accessible surface that can accommodate wheelchairs and prevent common accidents.",
        "Rosehill TPV® is a versatile rubber surfacing solution that can be used for a range of purposes, including playgrounds, sports facilities, and more. It has high UV resistance which helps preserve its colour and softness longer than other rubber surfacing solutions - making it perfect for coping with Spain’s climate.",
        "Thanks to VALORIZA ECORUBBER &amp; ENZA SOLUCIONES Y SERVICIOS SL"
      ],
      "images": [
        "PARQUE_INFANTIL_HOSPITAL_VALL_D_HEBRON_2.jpg",
        "PARQUE_INFANTIL_HOSPITAL_VALL_D_HEBRON__1.jpg",
        "PARQUE_INFANTIL_HOSPITAL_VALL_D_HEBRON_3.jpg"
      ]
    },
    {
      "title": "Transformed Play Area",
      "location": "Carmelita Carvajal Kindergarten, Chile",
      "date": "2024-03-06",
      "application": "playground",
      "description": [
        "In Las Condes, a bustling area of Santiago, Chile, Full Urbano has transformed the play area of Carmelita Carvajal Kindergarten with a vivid softfall surface. Utilising Rosehill TPV® pour-in-place rubber, they've created a dynamic, slip-resistant area that softens impacts from falls or tumbles, fostering a secure space for children to play and explore.",
        "Rosehill TPV® is a widely used surfacing solution that offers unmatched UV stability for playgrounds and areas that are often exposed to harsh environments. This means that the surface retains its bright colours and smooth texture for longer.",
        "Thanks to Full urbano"
      ],
      "images": [
        "Full_Urbano1.jpg",
        "Full_Urbano2.jpg"
      ]
    },
    {
      "title": "Recent Addition Of An Obstacle Course",
      "location": "Lowther Hall Anglican Grammar School",
      "date": "2024-03-11",
      "application": "playground",
      "description": [
        "The recent addition of an obstacle course at Lowther Hall Anglican Grammar School, enhanced with a Rosehill TPV® softfall surface, marks a significant upgrade in providing a safe play and exercise environment. Aimed at offering both fun and a physical challenge, this course is thoughtfully designed to keep students engaged and protected from slips and falls.",
        "Rosehill TPV® rubber has been used in fitness courses, parkour parks, and ninja warrior trails across Australia. It delivers a tactile surface that effectively cushions impacts and offers unmatched UV resistance, ensuring surfaces maintain their softness and vibrant colour even after years of exposure to harsh environments.",
        "Thanks to Grange Surfacing and Surface Designs TPV"
      ],
      "images": [
        "Lowther-Hall-Anglican-Grammar-School-2.jpeg",
        "Lowther-Hall-Anglican-Grammar-School-4.jpeg",
        "Lowther-Hall-Anglican-Grammar-School-5.jpeg",
        "Lowther-Hall-Anglican-Grammar-School-3.jpeg"
      ]
    },
    {
      "title": "New Playground Installed",
      "location": "Lowther Hall School",
      "date": "2024-03-20",
      "application": "playground",
      "description": [
        "The team at Grange Surfacing Pty Ltd has been busy at Lowther Hall School in Melbourne, first adding a Rosehill TPV® softfall surface to the recently installed fitness course, and now installing a protective surface for the school’s new playground.",
        "Featuring an impressive slide and climbing tower, the new playground includes a Rosehill TPV® surface designed to cushion falls and prevent common playground injuries. Thanks to its superior UV stability, the surface is built to endure Australia's tough climate, retaining its softness and colour for longer.",
        "The play area's design features a combination of Rosehill TPV® colours, enabling the creation of bespoke shades for intricate designs. This colour blending capability ensures the playground is not only visually striking but also a safe and engaging space for children to explore and play.",
        "Thanks to Grange Surfacing Pty Ltd and Surface Designs TPV"
      ],
      "images": []
    },
    {
      "title": "Unique Play Area",
      "location": "Darling Harbour, Sydney",
      "date": "2024-03-28",
      "application": "playground",
      "description": [
        "The Glooloop Surfacing Pty Ltd team has recently completed the installation of a Rosehill TPV® softfall surface at a unique play area in Darling Harbour, Sydney. This installation is part of the larger Ribbon Project, which included an IMAX cinema, retail spaces, and hotels being built along the harbour. The new play area offers a relaxing and enjoyable space for visitors when visiting the area.",
        "Rosehill TPV® is a versatile surfacing material, suitable for a variety of applications such as playgrounds, indoor areas, and sports venues. Its resilience against the harsh Australian climate and UV exposure ensures the retention of colour and texture over time, making it a preferred choice across the country.",
        "Thanks to Glooloop Surfacing Pty Ltd and Surface Designs TPV"
      ],
      "images": [
        "1709508823448.jpg",
        "1709508822532.jpg"
      ]
    },
    {
      "title": "Disability-Friendly Play Space",
      "location": "Northern Beaches Area, Australia",
      "date": "2024-04-04",
      "application": "playground",
      "description": [
        "A Rosehill TPV® rubber surface has recently been installed at a disability-friendly play space located in the picturesque Northern Beaches area of Australia. This colourful softfall surface will provide a cushioned landing, reducing the impact of common accidents. In addition to being easy to maintain, it retains its vibrant colour for an extended period, enhancing the aesthetic appeal of the play space.",
        "Our pour-in-place rubber offers a safe, allergy-free solution that is free from harmful substances and does not emit any contaminants into the environment. Adhering to international quality standards, it serves as an exceptional choice for applications such as playgrounds, fitness zones, and more!",
        "Thanks to Glooloop Surfacing Pty Ltd and Surface Designs TPV"
      ],
      "images": [
        "Northern_5.jpeg",
        "Northern_6.jpeg",
        "Northern_2.jpeg",
        "Northern_4.jpeg",
        "Northern_1.jpeg"
      ]
    },
    {
      "title": "Ysgol Cedewain Playground",
      "location": "Wales",
      "date": "2024-04-12",
      "application": "playground",
      "description": [
        "The playground at Ysgol Cedewain in Wales is swiftly approaching completion, with the first phase involving the installation of over 441 square meters of Rosehill TPV® softfall surface. Our pour-in-place rubber is celebrated for its long lasting colour and effectiveness in preventing common playground accidents.",
        "Despite prolonged exposure to Wales’ diverse weather conditions, Rosehill TPV® retains its suppleness, making it a reliable and superior choice for playground surfaces. We take pride in providing a wetpour rubber that is not only safe and allergen-free, but also devoid of harmful elements and does not contribute to environmental pollution.",
        "Thanks to Abacus Playgrounds"
      ],
      "images": [
        "1712217674036.jpg",
        "1712217672389.jpg"
      ]
    },
    {
      "title": "New Jungle-Themed Play Area",
      "location": "Westfield Parramatta Shopping Centre",
      "date": "2024-04-15",
      "application": "playground",
      "description": [
        "Check out the new jungle-themed play area at Westfield Parramatta Shopping Centre, designed to captivate children aged 2-5 with an imaginative and engaging environment. This space provides not only fun and discovery for the kids but also a relaxing area for parents to unwind.",
        "For safety, the area is equipped with Rosehill TPV® rubber surfacing to prevent slips, trips, and falls. The surface uses a unique blend of green rubber granules that harmonise with the jungle theme while prioritising the safety of young explorers.",
        "Rosehill TPV® is ideal for both indoor and outdoor settings, offering durability and exceptional UV stability. This ensures it retains its colour and softness longer, even under harsh conditions. With 22 available colours, designers can create bespoke patterns and themes to enhance any play space.",
        "Thanks to BLANC_SPACE, Synthetic Grass and Rubber Surfaces &amp; Surface Designs TPV"
      ],
      "images": [
        "Westfield_3.jpeg",
        "Westfield_1.jpeg"
      ]
    },
    {
      "title": "Colourful Softfall Surface",
      "location": "Ancud Kindergarten",
      "date": "2024-04-22",
      "application": "playground",
      "description": [
        "This colourful softfall surface can be found at a small kindergarten nestled near the Chilean coastline in the city of Ancud, situated on Chiloé Island. This area is renowned for its unique folklore, delectable cuisine, and distinctive architecture, drawing in tourists from all corners of the globe.",
        "The newly installed surface, made from durable Rosehill TPV® rubber, provides critical protection against common playground accidents. Designed to withstand the area’s wet and humid climate, it ensures longevity and safety. With a selection of 22 vivid colours, Rosehill TPV® offers endless possibilities for creating imaginative and engaging play areas that children will love.",
        "Thanks to Full urbano"
      ],
      "images": [
        "ANCUD_ISLA_DE_CHILOE2.jpg",
        "ANCUD_ISLA_DE_CHILOE1.jpg"
      ]
    },
    {
      "title": "Award-winning Playground",
      "location": "Small Town of Tūrangi, New Zealand.",
      "date": "2024-06-24",
      "application": "playground",
      "description": [
        "Te Kapua Park Playground in the small town of Tūrangi, New Zealand, has won two awards at the 2024 Resene NZILA Awards. Designed by Bespoke Landscape Architects in collaboration with the local community, the play area reflects the area's history and narrative. The playground’s surface represents the Tongariro River, and the surrounding landscape has a strong association with Ngati Turangitukua, making it a welcoming area rich with cultural representation.The NumatREC team installed a colourful softfall surface using blends of Rosehill TPV®, providing protection against slips, trips, and falls. With exceptional UV stability, the colours and softness remain intact even after prolonged exposure to New Zealand’s weather conditions, ensuring lasting enjoyment.Thanks to NumatREC, Bespoke Landscape Architects and everyone involved with this project."
      ],
      "images": [
        "u.jpg"
      ]
    },
    {
      "title": "Vibrant Community Space",
      "location": "Barton Park, Sydney.",
      "date": "2024-06-21",
      "application": "playground",
      "description": [
        "Barton Park in Banksia, Sydney, has been revitalised into a vibrant community space. The recent renovation project undertaken by Co-Ordinated Landscapes Pty Limited upgraded its play area with new playground equipment and featured Rosehill TPV® softfall surfaces. Expertly installed by the team at Glooloop Surfacing Pty Ltd, these poured-in-place rubber surfaces provide a safe and fun environment for kids to enjoy.Rosehill TPV® is renowned for its exceptional versatility as a rubber surfacing solution, ideal for playgrounds and sports facilities alike. Its superior UV stability ensures that the surfaces remain bright and soft over time, standing up to the demanding Australian climate.Thanks to Glooloop Surfacing Pty Ltd, Co-Ordinated Landscapes Pty Limited and Surface Designs TPV for the images."
      ],
      "images": [
        "Banksia-Park-Sydney.jpg"
      ]
    },
    {
      "title": "Newly Installed Playground",
      "location": "Nedachlebice, Czech Republic.",
      "date": "2024-06-19",
      "application": "playground",
      "description": [
        "In the picturesque village of Nedachlebice, located in the southeast of the Czech Republic, a newly installed playground now offers a vibrant and colourful play area for the children of its 800 residents. With Rosehill TPV’s selection of 22 colours, the potential for imaginative and creative surface designs is limitless, sparking the imaginations of children and providing a delightful space for play and adventure.Rosehill TPV® is renowned for its exceptional versatility as a rubber surfacing solution, perfect for outdoor play spaces. Its superior UV stability ensures that the surfaces remain bright and soft over time, standing up to challenging weather and demanding climates.Thanks to 3D Program - https://3dprogram.eu/home"
      ],
      "images": [
        "Nedachlebice-Czech-Republic.jpg"
      ]
    },
    {
      "title": "New Rosehill TPV® Softfall Surface",
      "location": "Caburn Park in Wingello, Australia.",
      "date": "2024-06-12",
      "application": "athletics",
      "description": [
        "The team at Australian Sports &amp; Safety Surfacing has successfully installed a Rosehill TPV® softfall surface at Caburn Park as part of the ongoing upgrade works. With the project’s completion slated for the 30th of June, residents of Wingello will soon enjoy the enhanced facilities, including a new bike pump track and a Fire Truck play station.Rosehill TPV® rubber is the preferred choice for installers worldwide. Its remarkable UV resistance ensures playground surfaces retain their vibrancy and softness, even after years of exposure to harsh weather conditions. With an extensive palette of 22 distinct colours, the possibilities for creating intricate patterns or themed softfall surfaces are limitless.Thanks to Australian Sports &amp; Safety Surfacing and Surface Designs TPV"
      ],
      "images": [
        "Caburn-Park-Australia.jpg"
      ]
    },
    {
      "title": "One Year Since Butlin’s Skegness SKYPARK Playground Officially Opened.",
      "location": "",
      "date": "2024-06-05",
      "application": "playground",
      "description": [
        "It's been over a year since Butlin’s Skegness SKYPARK playground officially opened, featuring one of the most vibrant Rosehill TPV® rubber surfaces we’ve ever seen. Incorporating more than 10 Rosehill TPV® colours, this soft-fall surface offers a secure and exciting play area for children of all ages and abilities.What sets Rosehill TPV® apart is its exceptional UV resistance, which ensures the longevity and brightness of its colours. Even after extended exposure to various weather conditions, it maintains its softness and comfort, reinforcing its reputation as a dependable and superior option for playground surfacing.Thanks to Butlin's, Abacus Playgrounds and Jupiter Play &amp; Leisure Ltd."
      ],
      "images": [
        "Skypark-Butlins-1.jpg"
      ]
    },
    {
      "title": "New Playspace Featuring  Rosehill TPV®",
      "location": "São Paulo, Brazil.",
      "date": "2024-05-29",
      "application": "playground",
      "description": [
        "Check out the first installation of Rosehill TPV® by Playtime | Playgrounds at a residential building in São Paulo, Brazil. This playspace features a range of coloured Rosehill rubber granules, creating a vibrant softfall surface that provides protection against slips, trips, and falls.Rosehill TPV® is a high-quality rubber surfacing solution, manufactured in the UK and distributed worldwide for creating softfall surfaces in any climate. With unbeatable UV stability, these surfaces are long-lasting and safe for playgrounds, fitness areas, and more, retaining their colour and softness years after installation.Thanks to Playtime | Playgrounds and TPV Color Brazil - https://tpvcolor.com.br/"
      ],
      "images": [
        "Brazil.jpg"
      ]
    },
    {
      "title": "Rosehill TPV® Featured",
      "location": "Sydney's iconic Olympic Park.",
      "date": "2024-04-26",
      "application": "playground",
      "description": [
        "Bicentennial Park West, nestled within Sydney's iconic Olympic Park, hosts a serene playground that stands out for its commitment to inclusivity, featuring a variety of play equipment accessible to children with diverse abilities. To enhance safety and minimise the risk of common playground accidents like slips, trips, and falls, the area is fitted with a vibrant Rosehill TPV® soft-fall surface, providing essential cushioning for play.Our pour-in-place rubber is not only safe and allergy-free but also devoid of any harmful substances, ensuring it does not release any contaminants into the environment. Rosehill TPV® is used for playgrounds across Australia, owing to its exceptional UV resistance, which ensures that the surfaces remain soft and retain their vibrant colours, even after enduring years of exposure to harsh conditions.Thanks to Glooloop Surfacing Pty Ltd &amp; Surface Designs TPV"
      ],
      "images": [
        "Sydeny-Olymbpic-Park-1.jpg"
      ]
    },
    {
      "title": "Safe and Vibrant School Play Area",
      "location": "New South Wales.",
      "date": "2024-07-01",
      "application": "playground",
      "description": [
        "Rosary Park School in the town of Branxton, New South Wales, has undergone a remarkable transformation. By combining Rosehill TPV® rubber granules with synthetic grass, the school now boasts a safe and vibrant play area for children.Rosehill TPV® is a rubber surfacing solution that is suitable for a range of applications, including playgrounds, sports facilities, and more. It is highly resistant to UV rays, meaning it can maintain its colour and softness for longer than other rubber surfacing solutions.Thanks to Synthatech Australia Pty Ltd, Collaborative Construction Solutions and Surface Designs TPV"
      ],
      "images": [
        "New-South-Wales.jpg"
      ]
    },
    {
      "title": "Upgraded Indoor Play Area Inside Canberra Centre",
      "location": "Australian Capital Territory.",
      "date": "2024-06-28",
      "application": "playground",
      "description": [
        "Canberra Centre, a large shopping complex in the Australian Capital Territory (ACT), features over 260 shops, restaurants, and services. The indoor play area is a popular spot where children can enjoy themselves while parents relax. Currently, the play space is undergoing an upgrade with the installation of new Rosehill TPV® softfall surfacing by Bruce’s Playground. This surfacing provides excellent cushioning against slips, trips, and falls.Rosehill TPV® rubber offers unmatched UV resistance, ensuring long-lasting vibrant colours and a soft surface for both indoor and outdoor applications. Our pour-in-place rubber is non-toxic and non-allergenic, free from harmful substances, and does not emit pollutants into the environment.Thanks to Bruce’s Playground and Surface Designs TPV."
      ],
      "images": [
        "Canberra-Centre-2.jpg"
      ]
    },
    {
      "title": "Marine Life-inspired Playground",
      "location": "Arenal d’en Castell, Menorca.",
      "date": "2024-07-03",
      "application": "playground",
      "description": [
        "The Club Hotel Aguamarina overlooks the seafront in Arenal d’en Castell, a popular destination on the Balearic Islands known for its beautiful sandy beaches and clear turquoise waters. Following a recent project at the hotel, the marine life-inspired Aquanimals Park is now ready to delight families this summer!Enhanced with vibrant Rosehill TPV® granules, the playground surface was transformed into a colourful and interactive space where children can create lasting holiday memories. Rosehill TPV® not only adds aesthetics but also offers protection against common accidents.Rosehill TPV® is a versatile rubber surfacing solution that can be used for a range of purposes, including playgrounds, sports facilities, and more. Its high UV resistance helps preserve its colour and softness longer than other rubber surfacing solutions, making it perfect for coping with Spain’s climate.Thanks to HAGS ESPAÑA and VALORIZA ECORUBBER."
      ],
      "images": [
        "Arenal-den-Castell-Menorca.jpg"
      ]
    },
    {
      "title": "Renovation Featuring Rosehill TPV®",
      "location": "Marsden Park Playground in Campbelltown, Adelaide.",
      "date": "2024-07-08",
      "application": "playground",
      "description": [
        "The Marsden Park Playground in Campbelltown, Adelaide, has reopened to the public after undergoing renovations. As part of the upgrade, the team at Glooloop Surfacing Pty Ltd installed new softfall surfacing using blends of Rosehill TPV® rubber. These surfaces not only complement the surrounding area but also provide cushioned landings, reducing the impact of common playground accidents.With 22 available colours, creating custom blends for any project is easy, resulting in striking and durable surfaces that maintain their vibrancy and softness even in harsh climates.Thanks to Glooloop Surfacing Pty Ltd and Surface Designs TPV"
      ],
      "images": [
        "Marsden-Park-playground-Cambelltown-Adelaide.jpg"
      ]
    },
    {
      "title": "Kareela Reserve Playground",
      "location": "Frankston is Undergoing an Exciting Renovation Featuring Rosehill TPV® Softfall Surfaces.",
      "date": "2024-07-15",
      "application": "playground",
      "description": [
        "After much feedback from the local community, Kareela Reserve Playground in Frankston is undergoing an exciting renovation with the aim of creating a vibrant play area for children and families living in the surrounding neighbourhood.The playground now boasts new equipment complemented by a delightful purple Rosehill TPV® softfall surface underneath, designed to enhance safety by cushioning falls and reducing trip hazards.Rosehill TPV® is a high-quality solution, offering a tactile surface that retains its vibrant colour and softness even after a long time in Australia’s harsh climate.Thanks to Grange Surfacing Pty Ltd and Surface Designs TPV."
      ],
      "images": [
        "Frankston-1.jpg"
      ]
    },
    {
      "title": "New Softfall Surface Being Installed Along the Coastline of Iquique",
      "location": "Chile.",
      "date": "2024-07-17",
      "application": "playground",
      "description": [
        "The team at Full urbano has been hard at work installing a vibrant softfall surface at a public playground along the picturesque coastline of Iquique, Chile. This bustling tourist destination is now home to a beautifully renovated play area that promises to captivate both locals and visitors.The unique and colourful design incorporates various blends of Rosehill TPV® rubber, creating not only a fun play area but also a surface that protects against common accidents. With exceptional resistance to UV rays, weather conditions, and wear and tear, Rosehill TPV® is an ideal match for Chile’s intense climate.Featuring a palette of 22 vibrant colours, the possibilities for imaginative and engaging softfall surface designs are limitless, ensuring both entertainment and safety for children.Thanks to Full urbano."
      ],
      "images": [
        "Chile-1.jpg"
      ]
    },
    {
      "title": "New Softfall Surface",
      "location": "Outdoor Gym In Baldivis, Western Australia",
      "date": "2024-07-29",
      "application": "playground",
      "description": [
        "Rosehill TPV® is the perfect choice for creating shock-absorbent surfaces that cushion falls, making it ideal for outdoor gyms like the one in Baldivis, Western Australia.",
        "Available in 22 colours, Rosehill TPV® allows for the design of both neutral and vibrant surfaces tailored to any project or landscape. This versatile surfacing material is ideal for playgrounds, sports venues, and more. Its exceptional durability against Australia’s harsh climate and UV exposure ensures that it retains colour and texture for years, making it a preferred choice across the country.",
        "Thanks to Perth Playground &amp; Rubber, Mirvac and Surface Designs TPV"
      ],
      "images": [
        "1722242494706.jpeg",
        "1722242494834.jpeg",
        "1722242494029.jpeg"
      ]
    },
    {
      "title": "New Playground Area",
      "location": "Whitten Oval In Footscray, Australia",
      "date": "2024-07-31",
      "application": "playground",
      "description": [
        "Check out this recent project that involved installing a Rosehill TPV® softfall surface at the new playground area in Whitten Oval, home to The Western Bulldogs AFL team in Footscray, Australia.",
        "Rosehill TPV® is a rubber surfacing solution highly resistant to UV rays, allowing it to maintain its colour and softness longer than other rubber surfaces. With 22 available colours, they can be combined to create custom blends suitable for any project, making it easier to design safe and fun softfall surfaces for children.",
        "Thanks to Grange Surfacing Pty Ltd, Normark Landscapes Pty Ltd and Surface Designs TPV"
      ],
      "images": []
    },
    {
      "title": "Recent Renovation Of Uncle Buck's Play Parlour At The Buckley's Entertainment Centre",
      "location": "Breakwater",
      "date": "2024-08-13",
      "application": "playground",
      "description": [
        "Buckley's Entertainment Centre in Breakwater is a family-friendly club that has recently renovated its facilities, including Uncle Buck's Play Parlour. Designed for young children to explore, climb, and balance, it features a thick Rosehill TPV® softfall surface that cushions trips and falls.",
        "The vibrant surface showcases custom blends of Rosehill's pink, green, and blue rubber granules, complementing the bright play area while offering a long-lasting solution.",
        "Rosehill TPV® is designed as a practical surfacing solution that effectively absorbs impacts while retaining its softness for many years after installation, regardless of climate and UV exposure.",
        "Thanks to Grange Surfacing Pty Ltd, archiplay and Surface Designs TPV"
      ],
      "images": [
        "Centre-12.jpg",
        "Centre-10.jpg",
        "Centre-13.jpg"
      ]
    },
    {
      "title": "Blue Rosehill TPV Surface At A Community Playground",
      "location": "Wanneroo.",
      "date": "2024-08-19",
      "application": "playground",
      "description": [
        "The team at Perth Playground &amp; Rubber recently installed a Rosehill TPV® softfall surface at a community playground in Wanneroo, near Perth. By blending two shades of blue, the new surface creates a visually striking area that not only looks good but also provides protection against slips, trips, and falls.",
        "Rosehill TPV® is renowned for its durability and vibrant colours, making it the ideal choice for playgrounds globally. Its superior UV resistance ensures that the surfaces stay colourful and flexible, maintaining quality and safety long after installation.",
        "Thanks to Perth Playground &amp; Rubber, Total Landscaping and Surface Designs TPV"
      ],
      "images": [
        "1724054645992.jpeg",
        "1724054644751.jpeg",
        "1724054643820.jpeg"
      ]
    },
    {
      "title": "Madrid Playground Transformation With Rosehill TPV",
      "location": "",
      "date": "2024-08-23",
      "application": "playground",
      "description": [
        "In the bustling heart of Madrid, a playground is undergoing a transformation with Rosehill TPV® pour-in-place rubber, chosen for its durability and vibrant colours. A striking blend of blue, green, and yellow not only enriches the playground's aesthetic but also ensures longevity and UV stability, withstanding Spain's demanding climate.",
        "Rosehill TPV® surfaces significantly enhance safety, offering a cushioning layer that protects children from slips, trips, and falls. This reassurance allows children to play freely and safely. Available in 22 colours, Rosehill TPV® provides endless possibilities to create engaging and aesthetically pleasing environments, from lively geometric patterns to serene natural tones.",
        "Thanks to VALORIZA ECORUBBER"
      ],
      "images": [
        "1724397276420.jpeg",
        "1724397276785.jpeg"
      ]
    },
    {
      "title": "SKYPARK Playground",
      "location": "Minehead Butlin's Holiday Site, Somerset",
      "date": "2024-08-27",
      "application": "playground",
      "description": [
        "Discover the newly opened SKYPARK playground at the Minehead Butlin’s Holiday site along the scenic Somerset coastline. This vibrant play area features six unique zones, each designed to cater to different ages and abilities, ensuring endless fun for every child during their holiday.",
        "Rosehill TPV® was selected for its outstanding performance, mirroring its successful application in the inaugural SKYPARK in Skegness. The dynamic colour blends not only enhance the aesthetic appeal of the playground but also provide a soft, impact-absorbing surface that minimises the risk of injuries from falls.",
        "What sets Rosehill TPV® apart is its exceptional UV resistance, ensuring the longevity and brightness of its colours. Even after extended exposure to various weather conditions, it maintains its softness and comfort, reinforcing its reputation as a dependable and superior option for playground surfacing.",
        "Thanks to Butlin's, Abacus Playgrounds, and Jupiter Play &amp; Leisure Ltd"
      ],
      "images": [
        "1724748077141.jpeg",
        "1724748074319.jpeg",
        "1724748073247.jpeg"
      ]
    },
    {
      "title": "Latest Rosehill TPV Installation",
      "location": "Australian School Playground",
      "date": "2024-09-02",
      "application": "playground",
      "description": [
        "We're thrilled to showcase one of Grange Surfacing Pty Ltd’s latest installations featuring Rosehill TPV® at a local school playground. Designed to increase safety, our pour-in-place rubber surfaces are chosen for play areas across Australia and globally, ensuring students can safely enjoy their outdoor activities.",
        "Rosehill TPV® is not just about safety; it’s about lasting performance and visual appeal. Our rubber granules are manufactured to be durable and remain vibrant and flexible, year after year. Thanks to its superior UV resistance, Rosehill TPV® stands up brilliantly against the elements, ensuring that play areas not only look great but also offer a safe environment for years to come.",
        "Thanks to Grange Surfacing Pty Ltd and Surface Designs TPV"
      ],
      "images": [
        "1725264615207-1.jpeg",
        "1725264616302-1.jpeg",
        "1725264615150-1.jpeg",
        "1725264615149-1.jpeg",
        "1725264614938-1.jpeg"
      ]
    },
    {
      "title": "Kings Road Playground",
      "location": "North Point, Hong Kong",
      "date": "2024-09-09",
      "application": "playground",
      "description": [
        "Explore the fantastic Kings Road Playground in North Point, Hong Kong! This wonderful space provides a safe and welcoming environment for families and children in the local community. Designed to encourage active play, the playground features interactive elements integrated into the softfall surface so kids can easily engage in games and exercise while having fun.Rosehill TPV® is a globally used pour-in-place rubber surfacing solution, providing vibrant, long-lasting surfaces for play areas. Its UV stability ensures surfaces retain their vivid colours and supple texture, making it ideal for regions with extreme weather and strong UV exposure. We have 22 colours available, allowing you to create stunning and vibrant surfaces for playground projects in your community.Thanks to The Win Win Group"
      ],
      "images": [
        "DSC01372.jpg",
        "DSC01388.jpg",
        "DSC01479.jpg"
      ]
    },
    {
      "title": "New Playground Surface",
      "location": "Pinnacle Park",
      "date": "2024-09-16",
      "application": "playground",
      "description": [
        "Exciting news from Glenmore Park, Sydney! Pinnacle Park's latest addition includes a play area surfaced with Rosehill TPV®'s pour-in-place rubber, providing a safe, cushioned environment for children. This durable surfacing is designed to withstand Australia’s varied climate and ensure long-lasting safety.",
        "Our extensive palette of 22 colours allows for creative and vibrant playground designs, or natural, understated looks that blend seamlessly with the surrounding environment. Rosehill TPV® is non-toxic, non-allergenic, and meets international safety standards, making it the ideal choice for enhancing public spaces.",
        "Thanks to Preferred Turf Pty Ltd, Glascott Landscape &amp; Civil and Surface Designs TPV"
      ],
      "images": [
        "Pinnacle-Park-2.jpeg",
        "Pinnacle-Park-6.jpeg",
        "Pinnacle-Park-1.jpeg",
        "Pinnacle-Park-4.jpeg",
        "Pinnacle-Park-3.jpeg"
      ]
    },
    {
      "title": "Newly Installed Playground",
      "location": "Belgrade, Serbia",
      "date": "2024-09-23",
      "application": "playground",
      "description": [
        "This newly installed playground in Belgrade, the capital city of Serbia, features a colourful Rosehill TPV® surface and showcases a symbolic design representing the cultures of both Serbia and Japan. Inspired by the close diplomatic relationship between the two countries, it includes famous landmarks such as Mount Fuji and the Temple of Saint Sava in vibrant motifs.Our wetpour rubber is a dependable solution, ideal for creating unique, long-lasting playground surfaces. Its UV stability ensures it retains its colour and softness for years after installation, regardless of the climate. With 22 colours available, you can create stunning themed or detailed playground surfaces that will enhance any community project."
      ],
      "images": [
        "Belgrade-1.jpg"
      ]
    },
    {
      "title": "Playground Installation",
      "location": "Coastal City Of Iquique, Chile",
      "date": "2024-09-30",
      "application": "playground",
      "description": [
        "The Full urbano team has done it again with an incredible playground installation in the coastal city of Iquique, Chile. This vibrant new softfall surface features paint-inspired motifs, utilising bold Rosehill TPV® colours to create a dynamic and safe play area.",
        "Our extensive palette of 21 colours allows for the creation of unique, custom blends tailored to any project's needs. Rosehill TPV® not only enhances the aesthetic of playgrounds but also prioritises safety, cushioning against slips, trips, and falls. Perfect for revitalising existing spaces or adding a splash of colour to new projects!",
        "Discover the potential of Rosehill TPV® to bring life and safety to any play area.",
        "Thanks to Full urbano"
      ],
      "images": [
        "Chile-2.jpg"
      ]
    },
    {
      "title": "Hillview Christian School Vibrant New Playground",
      "location": "",
      "date": "2024-10-07",
      "application": "playground",
      "description": [
        "Hillview Christian School in Christchurch, New Zealand has unveiled a vibrant new playground, recently completed by NumatREC. The project features a colourful Rosehill TPV® softfall surface, designed to keep play safe and engaging for years to come.",
        "The renovation includes brand new play equipment and a detailed wetpour surface enriched with a variety of floor games, inviting students to enjoy and explore in a dynamic environment. Rosehill TPV® ensures this playful oasis remains a safe, comfortable space with its durable, long-lasting surfaces that stay softer for longer, requiring minimal maintenance.",
        "With 21 colours available, Rosehill TPV® allows for custom blends to match any playground theme, from bright patterns to natural tones.",
        "Thanks to NumatREC and Surface Designs TPV"
      ],
      "images": [
        "1728291291082.jpeg",
        "1728291290878.jpeg"
      ]
    },
    {
      "title": "New Fitness Area",
      "location": "Webber Reserve In Perth, Australia",
      "date": "2024-10-15",
      "application": "playground",
      "description": [
        "Webber Reserve in Perth, Australia, has recently been transformed with the addition of a new community fitness area. Featuring a custom-designed Rosehill TPV® softfall surface, this space provides an inviting, accessible place for the local community, with effective impact absorption and cushioning for slips, trips, and falls.",
        "Rosehill TPV® rubber granules are versatile, ideal for projects ranging from outdoor gyms to indoor play spaces. Our colourful, long-lasting surfaces ensure both safety and visual appeal, with excellent UV stability that maintains vivid colours and softness, no matter the climate or weather conditions.",
        "Thanks to Perth Playground &amp; Rubber, KOMPAN Australia and Surface Designs TPV"
      ],
      "images": [
        "1728912575851.jpeg",
        "1728912575731.jpeg",
        "1728912575938.jpeg"
      ]
    },
    {
      "title": "Second Stage Of Renovations",
      "location": "Buckley's Entertainment Centre",
      "date": "2024-10-21",
      "application": "playground",
      "description": [
        "The second stage of renovations at Buckley’s Entertainment Centre in Geelong is now complete! The vibrant blends of pink, purple, and green bring the indoor play area to life, creating a fun environment for children of all ages to explore and enjoy.",
        "Perfect for both indoor and outdoor projects, Rosehill TPV® is a high-quality wetpour solution that creates long-lasting surfaces for park playgrounds, sports facilities, and more. With a selection of 21 vivid colours, Rosehill TPV® offers endless possibilities for creating imaginative and engaging play areas that children will love.",
        "Thanks to Grange Surfacing Pty Ltd, archiplay and Surface Designs TPV"
      ],
      "images": [
        "1729264039705.jpeg",
        "1729264039915.jpeg",
        "1729264039740.jpeg"
      ]
    },
    {
      "title": "Playground Installation",
      "location": "Petting Zoo In Donji Tovarnik, Serbia",
      "date": "2024-10-28",
      "application": "playground",
      "description": [
        "Take a look at the new playground installed at the petting zoo in Donji Tovarnik, Serbia! This vibrant play area, part of the region's newest tourist attraction, is designed to offer families an enjoyable and relaxing day out. With engaging floor games, climbing frames, and other fun features, it’s perfect for visitors of all ages.",
        "Rosehill TPV® was chosen for its high-quality, long-lasting wetpour surface, which ensures unmatched UV resistance — keeping playgrounds bright and soft for years to come. Flexible and dependable, Rosehill TPV® is ideal for a variety of environments, from playgrounds to splash parks and sports facilities, providing a cushioned surface that helps protect against slips, trips, and falls."
      ],
      "images": [
        "1730103490845.jpeg",
        "1730103491241.jpeg"
      ]
    },
    {
      "title": "Community Playground",
      "location": "Valdiva, Chile",
      "date": "2024-11-01",
      "application": "playground",
      "description": [
        "Take a look at Full urbano’s latest project in Chile—a community playground with stunning views over Valdivia! Featuring a vibrant Rosehill TPV® softfall surface, this playground combines fun, safety, and colour, creating an inviting space for children to play while providing essential cushioning against slips and falls.",
        "With 21 colours available, Rosehill TPV® makes it simple to create custom blends for unique, long-lasting designs that stay vibrant, even after years of exposure to harsh climates. Plus, our safe, non-toxic formulation ensures a surface free from harmful substances, meeting the highest international standards for safety and environmental care."
      ],
      "images": [
        "1730388431133.jpeg",
        "1730388431129.jpeg",
        "1730388431525.jpeg",
        "1730388431331.jpeg"
      ]
    },
    {
      "title": "Vibrant New Water Park",
      "location": "Birchip",
      "date": "2024-11-04",
      "application": "playground",
      "description": [
        "Memorial Park in Birchip has a vibrant new water park, bringing a fun and safe space for local children to enjoy. The Grange Surfacing Pty Ltd team did an excellent job installing a bright blue Rosehill TPV® surface, which not only enhances water flow but adds a splash of colour to the park.",
        "Rosehill TPV® is designed to provide a soft, tactile surface that helps prevent injuries—perfect for splash parks, playgrounds, indoor play areas, and more. Built to withstand Australia’s harsh climate and UV exposure, its colours and texture remain vibrant for years, making it a popular choice across the country.",
        "Thanks to Grange Surfacing Pty Ltd, Equipment Solutions Plus and Surface Designs TPV"
      ],
      "images": [
        "1730719831597.jpeg",
        "1730719831923.jpeg",
        "1730719832929.jpeg",
        "1730719829549.jpeg"
      ]
    },
    {
      "title": "Fitness Area Installed",
      "location": "Port Fairy Consolidated School",
      "date": "2024-11-11",
      "application": "playground",
      "description": [
        "Rosehill TPV® is an ideal choice for fitness areas, parkour parks, and ninja-style obstacle courses! Recently selected for the obstacle course at Port Fairy Consolidated School, Rosehill TPV® provides excellent impact absorption to help protect against accidents.",
        "With a tactile surface and outstanding UV resistance, it retains vibrant colours and softness even after years of exposure. Non-toxic and allergen-free, it’s a safe solution for both users and the environment, meeting international safety standards.",
        "Choose Rosehill TPV® for a durable, vibrant, and safe surface that inspires adventure!",
        "Thanks to Grange Surfacing Pty Ltd &amp; Surface Designs TPV"
      ],
      "images": [
        "1731324687720.jpeg",
        "1731324687760.jpeg",
        "1731324688024.jpeg"
      ]
    },
    {
      "title": "Vibrent TPV Snake Addition To A School",
      "location": "Perth",
      "date": "2024-11-15",
      "application": "playground",
      "description": [
        "It's amazing what you can do with Rosehill TPV®! Made with a mixture of 7 different colours, this vibrant TPV snake is a one-of-a-kind addition to this school in Perth. Our wetpour rubber offers an unbeatable solution for creating fun and interesting elements with a tactile and cushioned surface to protect against accidents.",
        "Rosehill TPV® boasts long-lasting UV stability, ensuring that softfall surfaces remain vibrant and durable. Perfect for a variety of settings—from indoor and outdoor playgrounds to splash parks—this flexible material can be shaped into balancing blocks, steppers, and other 3D shapes.",
        "It's never been easier to add engaging and dynamic features to your project.",
        "Thanks to Perth Playground &amp; Rubber and Surface Designs TPV"
      ],
      "images": [
        "1731665400788.jpeg",
        "1731665400749.jpeg"
      ]
    },
    {
      "title": "Public Fitness Area",
      "location": "Iquique, Chile",
      "date": "2024-11-18",
      "application": "playground",
      "description": [
        "The coastal city of Iquique in Chile showcases several stunning Rosehill TPV® installations, brought to life by the fantastic team at Full urbano. From vibrant playgrounds to public fitness areas along the beach, they've transformed spaces into safe and colourful environments for the community.",
        "Rosehill TPV® wetpour surfaces are perfect for absorbing impacts, making them ideal for playgrounds, sports facilities, and fitness areas. With exceptional UV stability, our surfaces maintain their colour and softness, no matter the climate, delivering a low-maintenance, long-lasting solution that enhances safety and fun.",
        "Thanks to Full urbano"
      ],
      "images": [
        "1731918497908.jpeg",
        "1731918497710.jpeg"
      ]
    },
    {
      "title": "Yellowwood Park Parkour Fitness Area",
      "location": "",
      "date": "2024-11-25",
      "application": "playground",
      "description": [
        "Yellowwood Park in Harrisdale is undergoing a series of upgrades to create a family-friendly space with a focus on youth-oriented environments and equipment. These improvements include adding study pods, new park amenities, and an exciting parkour fitness area.",
        "The parkour area features a Rosehill TPV® softfall surface made using a vibrant blend of blue, grey, and cream rubber granules. This surface provides excellent impact absorption for slips and falls, helping to reduce injuries from accidents.",
        "Rosehill TPV® is perfect for a range of applications, both indoors and outdoors, creating vibrant softfall surfaces for playgrounds, fitness areas, splash parks, and more. Unmatched UV stability means our wetpour rubber is used around the world in some of the harshest climates, while still retaining a soft and colourful surface year after year.",
        "Thanks to Perth Playground &amp; Rubber, Surface Designs TPV and Gecko Contracting"
      ],
      "images": [
        "1732522648537.jpeg",
        "1732522648533.jpeg"
      ]
    },
    {
      "title": "Hassell Park Caterpiller Playground",
      "location": "New South Wales",
      "date": "2024-12-04",
      "application": "playground",
      "description": [
        "The new playground at Hassell Park, New South Wales, now boasts a nature-inspired Rosehill TPV® softfall surface that beautifully complements the caterpillar play equipment and the surrounding woodland. This vibrant surface not only enhances safety but also adds a touch of colour that will keep the playground looking inviting for years to come.",
        "Rosehill TPV® is renowned for its versatility, making it the perfect choice for everything from playgrounds to sports facilities. With exceptional UV resistance, it retains both its colour and softness—ideal for enduring Australia’s challenging climate.",
        "Thanks to Surface Designs TPV, Glooloop Surfacing Pty Ltd and GJ's Landscape and Civil"
      ],
      "images": [
        "1733299759343.jpeg",
        "1733299759621.jpeg",
        "1733299759877.jpeg"
      ]
    },
    {
      "title": "Renovations",
      "location": "A Public Park In Freshwater Beach, NSW",
      "date": "2025-01-06",
      "application": "playground",
      "description": [
        "Renovations at the public park in Freshwater Beach, NSW, include an aquatic-themed playground inspired by the area's iconic landscape. This upgrade provides a delightful and relaxing space for both visitors and the local community to enjoy.",
        "The playground's vibrant themed surface, made with Rosehill TPV® wetpour rubber, offers a perfect solution for longer-lasting protection against trips and falls. Thanks to its UV resistance, these areas retain their durability and softness for many years after installation, regardless of the local climate.",
        "With 21 available colours, it’s easy to incorporate colourful motifs, patterns, and floor games into community spaces. You can also mix multiple colours to create unique blends for ultimate customisability.",
        "A big thank you to Surface Designs TPV, Glooloop Surfacing Pty Ltd, and Regal Innovations for helping transform this space."
      ],
      "images": [
        "Freshwater_Beach_2.jpg",
        "Freshwater_Beach_5.jpg",
        "Freshwater_Beach_1.jpg",
        "Freshwater_Beach_3.jpg"
      ]
    },
    {
      "title": "Vibrant Splash Park",
      "location": "Mijas, Costa Del Sol",
      "date": "2025-01-13",
      "application": "playground",
      "description": [
        "Take a look at this vibrant splash park in Mijas, Costa del Sol, where Rosehill TPV® has been used to create a durable and safe surface for families to enjoy. Designed to cushion falls and reduce accident risks, our high-performance rubber flooring adds both functionality and fun to this public space.",
        "Rosehill TPV® granules are UV-stable, ensuring they retain their vibrant colour and softness even in harsh climates and unpredictable weather. With 21 colours available, creating custom blends to bring unique designs to life has never been easier. A perfect long-lasting solution for safer, brighter splash parks and public spaces!",
        "Thanks to VALORIZA ECORUBBER"
      ],
      "images": [
        "IMG-20241217-WA0001.jpg",
        "IMG-20241217-WA0016.jpg",
        "IMG-20241217-WA0013.jpg"
      ]
    },
    {
      "title": "Playground Transformed",
      "location": "Cheltenham Primary School",
      "date": "2025-01-20",
      "application": "playground",
      "description": [
        "Last year, Grange Surfacing transformed the playground at Cheltenham Primary School in Melbourne with a series of blue and grey wetpour rubber mounds. These playful additions create a safe and engaging environment for students, offering protection from trips and falls during their adventures.",
        "Rosehill TPV® is the perfect choice for vibrant and durable playground surfaces. Its exceptional UV stability ensures colours stay bright and surfaces remain soft, even in harsh climates, delivering long-lasting performance for over a decade.",
        "This versatile material can be shaped into interactive 3D features like mounds and balancing blocks, encouraging mobility, coordination, and active play while bringing imagination to life.",
        "Thanks to Grange Surfacing Pty Ltd, Surface Designs TPV and Programmed Property Services"
      ],
      "images": [
        "Cheltenham_School_4.jpg",
        "Cheltenham_School_3.jpg",
        "Cheltenham_School_2.jpg"
      ]
    },
    {
      "title": "Rosehill TPV Softfall Surface",
      "location": "Vergara Park In Angol, Chile",
      "date": "2025-01-30",
      "application": "playground",
      "description": [
        "Vergara Park in Angol, Chile, has been transformed with a vibrant Rosehill TPV® softfall surface, thanks to the talented team at Full Urbano. The new design is bursting with colour and creativity, featuring playful patterns that bring the playground to life while ensuring a safer, more engaging space for the community to enjoy.",
        "Rosehill TPV® surfaces are ideal for creating durable, UV-stable designs for playgrounds, sports areas, splash parks, and more. They maintain their elasticity and colour over time, require minimal maintenance, and provide reliable cushioning to help prevent everyday accidents.",
        "A perfect blend of safety, durability, and imaginative design!",
        "Thanks to Full Urbano"
      ],
      "images": [
        "Angol_Chile_-2.jpg",
        "Angol_Chile_-1.jpg"
      ]
    },
    {
      "title": "Rosehill TPV Installation",
      "location": "Canberra National Zoo",
      "date": "2025-02-04",
      "application": "playground",
      "description": [
        "Discover the stunning new Rosehill TPV® installation at the National Zoo in Canberra, Australia! Expertly delivered by Bruce’s Playgrounds, the design features a nature-inspired colour palette with intricate animal motifs, seamlessly combining aesthetics and safety.",
        "Rosehill TPV® provides impact-absorbing protection, helping to cushion trips and falls—perfect for playgrounds, sports areas, and more. With a lifespan of over 10 years, even in extreme climates, it ensures long-lasting performance.",
        "Our unique rubber surfacing solution is available in 21 vibrant colours, making the design possibilities endless!",
        "Thanks to Surface Designs TPV &amp; Bruce’s Playgrounds"
      ],
      "images": [
        "Canberra_Zoo_1.jpg"
      ]
    },
    {
      "title": "Exciting Renovation",
      "location": "Wollundry Park In NSW, Australia",
      "date": "2025-02-10",
      "application": "playground",
      "description": [
        "Wollundry Park in NSW, Australia reopened in July last year following an exciting renovation, which included a vibrant Rosehill TPV® softfall surface. The team at Australian Sports &amp; Safety Surfaces delivered an outstanding installation, creating a safe, durable, and long-lasting play space for the Pennant Hills community to enjoy for years to come.",
        "Designed to withstand Australia’s unpredictable weather, Rosehill TPV® offers exceptional UV stability and low maintenance, making it ideal for playgrounds, splash parks, and recreational spaces. Its cushioned surface helps reduce the impact of trips and falls, ensuring a safer environment for all.",
        "Thanks to Surface Designs TPV and Australian Sports &amp; Safety Surfaces"
      ],
      "images": [
        "Wollundry_Park_5.jpg",
        "Wollundry_Park_3.jpg",
        "Wollundry_Park_4.jpg",
        "Wollundry_Park_1.jpg"
      ]
    },
    {
      "title": "Vibrant Softfall Surface",
      "location": "Macquarie Fields, Sydney",
      "date": "2025-02-17",
      "application": "playground",
      "description": [
        "This vibrant softfall surface in Macquarie Fields, Sydney, is a perfect example of how Rosehill TPV® combines safety with aesthetics. With a palette of 21 colours, our granules transform playgrounds into engaging, long-lasting spaces for children to enjoy.",
        "Chosen by installers worldwide, Rosehill TPV® offers exceptional UV resistance, ensuring surfaces stay bright and soft, even in extreme weather. Our pour-in-place rubber is safe, allergy-free, and free from harmful substances, meaning it won’t release contaminants into the environment.",
        "Thanks to Glooloop Surfacing and Surface Designs TPV"
      ],
      "images": [
        "Macquarie_Fields_2.jpg",
        "Macquarie_Fields_1.jpg"
      ]
    },
    {
      "title": "New Park",
      "location": "El Raval, Barcelona",
      "date": "2025-02-28",
      "application": "playground",
      "description": [
        "Nestled in the heart of Barcelona, the new park in El Raval has been transformed into a vibrant community space. Using blends of Rosehill TPV®, the park features Autumn Gold and Desert Road mixes, perfectly complementing the surrounding landscape while providing a soft, cushioned surface to help prevent common playtime accidents.",
        "Built to withstand harsh weather and years of adventure, Rosehill TPV® softfall surfaces last for over a decade after installation. Trusted by installers worldwide, our slip-resistant, UV-stable granules enhance safety while bringing bold colour and durability to playgrounds, splash parks, and recreational spaces.",
        "Thanks to VALORIZA ECORUBBER"
      ],
      "images": [
        "El-Raval_4.jpg",
        "El-Raval_2.jpg",
        "El-Raval_3.jpg"
      ]
    },
    {
      "title": "Playground Transformations Across Araucanía Region Of Chile",
      "location": "",
      "date": "2025-03-03",
      "application": "playground",
      "description": [
        "The Araucanía region of Chile is experiencing a playground transformation with the installation of visually stunning play spaces featuring Rosehill TPV®. These new installations showcase captivating patterns and vibrant colour combinations that have revitalised community areas while providing crucial safety surfacing.",
        "Specially formulated for superior UV stability, Rosehill TPV® is the perfect choice for Chile's varied climate, maintaining its colour vibrancy and essential softness for years after installation. This resilience ensures these playgrounds will continue to delight children and reassure parents long into the future.",
        "With our palette of 21 colours, local designers have created truly unique environments that stimulate children's imaginations and turn ordinary play spaces into extraordinary adventures.",
        "We’re pleased to see our products bringing joy to communities across Chile while providing the safety and durability that make them a sound investment for municipalities.",
        "Thanks to Full Urbano"
      ],
      "images": [
        "Araucania_Chile_1.png",
        "Araucania_Chile_3.png",
        "Araucania_Chile_2.png"
      ]
    },
    {
      "title": "Splash Of Fun",
      "location": "Australian Playground",
      "date": "2025-03-17",
      "application": "playground",
      "description": [
        "These fantastic TPV frogs bring a splash of fun to a playground in Australia, creatively showcasing the stages of a frog’s life cycle. Designed as imaginative balancing blocks, they’re coated in Rosehill TPV®, providing a cushioned, grippy surface that enhances both safety and play.",
        "Our rubber wetpour opens up endless design possibilities, from simple shapes to intricate animal sculptures. With 21 vibrant colours to choose from, it’s easy to create engaging playground features, interactive floor games, and striking 3D elements—bringing imaginative play to life in the safest way possible.",
        "Thanks to Rubberworx and Surface Designs TPV"
      ],
      "images": [
        "1741965144566.jpeg"
      ]
    },
    {
      "title": "New Soft-Fall Surface",
      "location": "A Nursery In Los Ángeles, Chile",
      "date": "2025-03-23",
      "application": "playground",
      "description": [
        "Rosehill TPV® was the perfect soft-fall surface for this nursery in Los Ángeles, Chile, offering a durable, high-performance solution to reduce the risk of slips and falls. Combined with colourful balancing blocks, the tactile, grippy surface of our wet-pour rubber keeps little adventurers safe while they play.",
        "With a palette of 21 vibrant colours and the ability to create custom blends, Rosehill TPV® allows for truly unique and engaging designs. Its outstanding UV stability ensures colours stay bright and surfaces remain soft, even in challenging climates, year after year.",
        "Made from a non-toxic formulation, Rosehill TPV® meets the highest international standards for safety and environmental responsibility—making it a trusted choice for playgrounds around the world.",
        "Thanks to Full urbano"
      ],
      "images": [
        "1742568794283.jpeg",
        "1742568794475.jpeg",
        "1742568794598.jpeg"
      ]
    },
    {
      "title": "Lingnan University's New Outdoor Fitness Gym",
      "location": "",
      "date": "2025-03-31",
      "application": "safety",
      "description": [
        "Rosehill TPV® was the ideal choice for Lingnan University’s new outdoor fitness gym, delivering outstanding support, durability, and long-term performance.The newly installed softfall surface provides excellent cushioning for high-impact activities, while retaining its elasticity and vibrant appearance—even in challenging weather conditions.Engineered for safety and designed to last, our UV-stable wetpour surfaces are perfect for everything from outdoor gyms to indoor play areas, combining performance with visual appeal."
      ],
      "images": [
        "DSC06567.jpg",
        "DSC06559.jpg",
        "DSC06580.jpg"
      ]
    },
    {
      "title": "Vibrent Fitness Area",
      "location": "Maipú, Chile",
      "date": "2025-04-07",
      "application": "playground",
      "description": [
        "Bright, bold, and built to last—this vibrant fitness area in Maipú, part of Greater Santiago, Chile, showcases the impact and versatility of Rosehill TPV®.",
        "More than just eye-catching patterns, the colourful surface delivers enhanced safety and long-term performance. Its impact-absorbing properties help reduce the risk of injury during everyday activity, while its durability ensures it stands up to heavy use.",
        "Designed to thrive in Chile’s climate, Rosehill TPV® offers outstanding UV stability—keeping colours vivid and surfaces soft, even under the sunniest skies. With 21 colours to choose from, creating bespoke designs and unique blends is simple.",
        "Thanks to Full urbano"
      ],
      "images": [
        "Maipu-Chile-1.jpg",
        "Maipu-Chile-2.jpg",
        "Maipu-Chile-3.jpg"
      ]
    },
    {
      "title": "New Play Area",
      "location": "Foulath Clubhouse In Al Hidd, Bahrain",
      "date": "2025-04-28",
      "application": "playground",
      "description": [
        "The Foulath Clubhouse in Al Hidd, Bahrain, is now home to a stunning new play area surfaced with Rosehill TPV® — combining vibrant colour with long-lasting safety and durability.Designed to absorb impact and reduce the risk of injury, this poured-in-place surface offers a soft, safe environment where children can play freely for years to come.UV-resistant and weatherproof, Rosehill TPV® stays bright and soft even in the harshest climates. It’s trusted by installers worldwide for its performance, safety, and sustainability — free from harmful substances and kind to the environment.With 21 colours to choose from, designers can mix and match to create custom blends that bring any playground to life."
      ],
      "images": [
        "1745831132656.jpeg",
        "1745831132394.jpeg",
        "1745831132484.jpeg"
      ]
    },
    {
      "title": "Barcelona's Parc De Les Glòries Vibrent Transformation",
      "location": "",
      "date": "2025-05-12",
      "application": "playground",
      "description": [
        "Once a major urban thoroughfare, Parc de les Glòries in the heart of Barcelona has been transformed into a vibrant, family-friendly green space. With basketball courts, ping-pong tables, open recreational areas, and dog-friendly zones, it’s become a true community hub.",
        "As part of this transformation, Rosehill TPV® was selected for the park’s new soft-fall play areas—helping to create a safer, more inclusive space for children. Our UV-stable, long-lasting surface minimises the risk of trips and falls while maintaining its bright appearance, even in Barcelona’s intense sun.",
        "Made from a non-toxic, non-allergenic compound that contains no harmful substances or pollutants, Rosehill TPV® offers a dependable, environmentally responsible alternative for public spaces where safety, durability, and visual impact all matter.",
        "Thanks to ENZA SOLUCIONES Y SERVICIOS SL and VALORIZA ECORUBBER"
      ],
      "images": [
        "Barcelona_1.jpg",
        "Barcelona_2.jpg",
        "Barcelona_3.jpg"
      ]
    },
    {
      "title": "Vibrant New Basketball Court",
      "location": "General Cruz, Chile",
      "date": "2025-05-19",
      "application": "playground",
      "description": [
        "A vibrant new basketball court in the small Chilean town of General Cruz now features a softfall surface made from Rosehill TPV®, providing a safe, long-lasting solution for players of all ages.",
        "Our unique wetpour rubber system offers reliable cushioning to support physical activity and help reduce the risk of injury from everyday slips, trips, and falls.",
        "Trusted by installers around the world, Rosehill TPV® is renowned for its exceptional UV stability, maintaining its softness and colour even in harsh weather conditions. It’s also non-toxic, allergy-free, and contains no harmful substances, ensuring a safe and sustainable choice for any outdoor environment.",
        "Thanks to Full urbano"
      ],
      "images": [
        "Chilean-Basketball-Court-2.png",
        "Chilean-Basketball-Court-3.png"
      ]
    },
    {
      "title": "Standout Basketball Court Installation",
      "location": "Nike's Headquarters, Belgium",
      "date": "2025-06-09",
      "application": "playground",
      "description": [
        "The team at Flexidal has delivered a standout installation at Nike’s headquarters in Belgium, creating a bespoke basketball court that combines bold design with enhanced safety.",
        "Using custom blends of Rosehill TPV®, the surface brings visual impact while providing crucial impact absorption for players. The result is a high-performance court that looks as good as it performs.",
        "Thanks to its exceptional UV stability, Rosehill TPV® retains its colour, elasticity, and softness over time, even in extreme climates. It’s a durable, low-maintenance solution trusted around the world for safety-critical environments.",
        "Versatile and resilient, Rosehill TPV® is ideal for new builds and refurbishments alike, whether for courts, playgrounds, splash parks or gyms.",
        "Thanks to Flexidal"
      ],
      "images": [
        "NIKE_Basketball_Court_2.jpg",
        "NIKE_Basketball_Court_3.jpg"
      ]
    },
    {
      "title": "Playground Installation",
      "location": "Sulaymaniyah, Iraq",
      "date": "2025-06-16",
      "application": "playground",
      "description": [
        "Rosehill TPV® is transforming play spaces around the world - like this striking installation in Sulaymaniyah, Iraq. The bold blue softfall surface doesn’t just add visual impact; it provides reliable protection from everyday playtime falls.Engineered for harsh climates, Rosehill TPV® offers exceptional UV stability, retaining its colour and softness for years, even under intense sun. With a palette of 21 vibrant colours, designers can blend and customise surfaces to suit any environment, from community playgrounds to splash parks.Wherever it’s used, Rosehill TPV® delivers lasting safety, standout colour, and performance you can trust."
      ],
      "images": [
        "Sulaymaniyah_2.png",
        "Sulaymaniyah_3.png"
      ]
    }
  ]
}